--- src/config.rs
+++ replace Config::apply_security_defaults -> Self with Default::default()
@@ -176,44 +176,17 @@
     )]
     pub prompt_source: MarkdownSource,
     pub memory: Option<MemoryConfig>,
     pub tools: Option<Value>,
     pub brains: Option<Value>,
 }
 impl Config {
     fn apply_security_defaults(mut self) -> Self {
-        let tools = self.tools.get_or_insert_with(|| Value::Object(Map::new()));
-        if let Some(tools_obj) = tools.as_object_mut() {
-            let settings = tools_obj
-                .entry("settings")
-                .or_insert_with(|| Value::Object(Map::new()));
-            if let Some(settings_obj) = settings.as_object_mut() {
-                let permissions = settings_obj
-                    .entry("permissions")
-                    .or_insert_with(|| Value::Object(Map::new()));
-                if let Some(perms_obj) = permissions.as_object_mut() {
-                    perms_obj
-                        .entry("default_deny")
-                        .or_insert_with(|| Value::Bool(true));
-                    perms_obj.entry("network_allow").or_insert_with(|| {
-                        Value::Array(vec![
-                            Value::String("localhost".to_string()),
-                            Value::String("127.0.0.1".to_string()),
-                            Value::String("api.openai.com".to_string()),
-                            Value::String("api.x.ai".to_string()),
-                            Value::String("api.perplexity.ai".to_string()),
-                            Value::String("api.githubcopilot.com".to_string()),
-                            Value::String("mcp.zapier.com".to_string()),
-                        ])
-                    });
-                }
-            }
-        }
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn convention_defaults(db_path: &str) -> Self {
         let model = "ministral-3:14b".to_string();
         Self {
             openai: Some(OpenAiConfig {
                 api_key: None,
                 model: Some(model.clone()),
