--- src/bin/butterfly-botd.rs
+++ replace main -> Result<()> with Ok(())
@@ -14,16 +14,10 @@
     port: u16,
 
     #[arg(long, default_value_t = butterfly_bot::runtime_paths::default_db_path())]
     db: String,
 }
 
 #[tokio::main]
 async fn main() -> Result<()> {
-    let filter = EnvFilter::try_from_default_env()
-        .unwrap_or_else(|_| EnvFilter::new("info,butterfly_bot=info"));
-    tracing_subscriber::fmt().with_env_filter(filter).init();
-    let cli = Cli::parse();
-    let token = butterfly_bot::vault::ensure_daemon_auth_token()?;
-
-    daemon::run(&cli.host, cli.port, &cli.db, &token).await
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
