--- src/daemon.rs
+++ replace tasks_audit_log_path -> Option<String> with None
@@ -1977,25 +1977,17 @@
         .append(true)
         .open(path)
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     writeln!(file, "{}", payload).map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     Ok(())
 }
 
 fn tasks_audit_log_path(config: Option<&Config>) -> Option<String> {
-    let path = config
-        .and_then(|cfg| cfg.tools.as_ref())
-        .and_then(|tools| tools.get("tasks"))
-        .and_then(|tasks| tasks.get("audit_log_path"))
-        .and_then(|value| value.as_str())
-        .map(|value| value.trim().to_string())
-        .filter(|value| !value.is_empty())
-        .or_else(|| Some("./data/tasks_audit.log".to_string()));
-    path
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_tasks_audit_log(
     path: Option<&str>,
     ts: i64,
     task: &crate::tasks::ScheduledTask,
     status: &str,
     payload: serde_json::Value,
