--- src/client.rs
+++ replace ButterflyBot::register_tool -> Result<bool> with Ok(false)
@@ -94,29 +94,16 @@
     }
 
     pub async fn set_prompt_markdown(&self, prompt_markdown: Option<String>) {
         let agent_service = self.query_service.agent_service();
         agent_service.set_prompt_markdown(prompt_markdown).await;
     }
 
     pub async fn register_tool(&self, tool: Arc<dyn Tool>) -> Result<bool> {
-        let agent_service = self.query_service.agent_service();
-        let registry = agent_service.tool_registry.clone();
-        if !registry.register_tool(tool.clone()).await {
-            return Ok(false);
-        }
-        let assigned = registry
-            .assign_tool_to_agent(agent_service.agent_name(), tool.name())
-            .await;
-        if !assigned {
-            return Err(ButterflyBotError::Runtime(
-                "Tool registered but could not assign to agent".to_string(),
-            ));
-        }
-        Ok(true)
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn brain_tick(&self) {
         let agent_service = self.query_service.agent_service();
         agent_service.dispatch_brain_tick().await;
     }
 }
