--- src/client.rs
+++ delete ! in ButterflyBot::register_tool
@@ -102,17 +102,17 @@
         let agent_service = self.query_service.agent_service();
         let registry = agent_service.tool_registry.clone();
         if !registry.register_tool(tool.clone()).await {
             return Ok(false);
         }
         let assigned = registry
             .assign_tool_to_agent(agent_service.agent_name(), tool.name())
             .await;
-        if !assigned {
+        if  /* ~ changed by cargo-mutants ~ */assigned {
             return Err(ButterflyBotError::Runtime(
                 "Tool registered but could not assign to agent".to_string(),
             ));
         }
         Ok(true)
     }
 
     pub async fn brain_tick(&self) {
