--- src/daemon.rs
+++ replace security_finding -> SecurityAuditFinding with Default::default()
@@ -641,24 +641,17 @@
 fn security_finding(
     id: &str,
     severity: &str,
     status: &str,
     message: String,
     fix_hint: Option<&str>,
     auto_fixable: bool,
 ) -> SecurityAuditFinding {
-    SecurityAuditFinding {
-        id: id.to_string(),
-        severity: severity.to_string(),
-        status: status.to_string(),
-        message,
-        fix_hint: fix_hint.map(str::to_string),
-        auto_fixable,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn severity_rank(severity: &str) -> u8 {
     match severity {
         "critical" => 4,
         "high" => 3,
         "medium" => 2,
         _ => 1,
