--- src/client.rs
+++ replace ButterflyBot::from_config -> Result<Self> with Ok(Default::default())
@@ -11,18 +11,17 @@
 use tokio::sync::broadcast;
 
 pub struct ButterflyBot {
     query_service: QueryService,
 }
 
 impl ButterflyBot {
     pub async fn from_config(config: Config) -> Result<Self> {
-        let query_service = ButterflyBotFactory::create_from_config(config).await?;
-        Ok(Self { query_service })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn from_config_with_events(
         config: Config,
         ui_event_tx: Option<broadcast::Sender<UiEvent>>,
     ) -> Result<Self> {
         let query_service =
             ButterflyBotFactory::create_from_config_with_events(config, ui_event_tx).await?;
