--- src/client.rs
+++ replace ButterflyBot::from_config_with_events -> Result<Self> with Ok(Default::default())
@@ -19,19 +19,17 @@
         let query_service = ButterflyBotFactory::create_from_config(config).await?;
         Ok(Self { query_service })
     }
 
     pub async fn from_config_with_events(
         config: Config,
         ui_event_tx: Option<broadcast::Sender<UiEvent>>,
     ) -> Result<Self> {
-        let query_service =
-            ButterflyBotFactory::create_from_config_with_events(config, ui_event_tx).await?;
-        Ok(Self { query_service })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn from_store(db_path: &str) -> Result<Self> {
         let config = Config::from_store(db_path)?.resolve_vault()?;
         let agent = Self::from_config(config).await?;
         Ok(agent)
     }
 
