--- src/daemon.rs
+++ replace != with == in run_security_audit_checks
@@ -758,17 +758,17 @@
                 "search_internet",
                 "tasks",
                 "todo",
                 "wakeup",
             ];
             let mut non_wasm_tools = Vec::new();
             for tool_name in built_in_tools {
                 let plan = sandbox.execution_plan(tool_name);
-                if plan.runtime != ToolRuntime::Wasm {
+                if plan.runtime == /* ~ changed by cargo-mutants ~ */ ToolRuntime::Wasm {
                     non_wasm_tools.push(tool_name);
                 }
             }
 
             if non_wasm_tools.is_empty() {
                 findings.push(security_finding(
                     "tool_runtime_invariant",
                     "low",
