--- src/db.rs
+++ replace tune_sqlcipher_log_level_async with ()
@@ -14,24 +14,17 @@
     if let Err(err) =
         diesel::RunQueryDsl::execute(diesel::sql_query("PRAGMA cipher_log_level = ERROR"), conn)
     {
         tracing::debug!("Unable to set SQLCipher log level (sync): {}", err);
     }
 }
 
 async fn tune_sqlcipher_log_level_async(conn: &mut SyncConnectionWrapper<SqliteConnection>) {
-    if let Err(err) = diesel_async::RunQueryDsl::execute(
-        diesel::sql_query("PRAGMA cipher_log_level = ERROR"),
-        conn,
-    )
-    .await
-    {
-        tracing::debug!("Unable to set SQLCipher log level (async): {}", err);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn log_sqlcipher_key_source_once(source: &str) {
     static LOGGED: OnceLock<()> = OnceLock::new();
     if LOGGED.set(()).is_ok() {
         tracing::info!(db_key_source = source, "Resolved SQLCipher key source");
     }
 }
