--- src/client.rs
+++ replace ButterflyBot::from_store -> Result<Self> with Ok(Default::default())
@@ -25,19 +25,17 @@
         ui_event_tx: Option<broadcast::Sender<UiEvent>>,
     ) -> Result<Self> {
         let query_service =
             ButterflyBotFactory::create_from_config_with_events(config, ui_event_tx).await?;
         Ok(Self { query_service })
     }
 
     pub async fn from_store(db_path: &str) -> Result<Self> {
-        let config = Config::from_store(db_path)?.resolve_vault()?;
-        let agent = Self::from_config(config).await?;
-        Ok(agent)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn from_store_with_events(
         db_path: &str,
         ui_event_tx: Option<broadcast::Sender<UiEvent>>,
     ) -> Result<Self> {
         let config = Config::from_store(db_path)?.resolve_vault()?;
         let agent = Self::from_config_with_events(config, ui_event_tx).await?;
