--- src/client.rs
+++ replace ButterflyBot::from_store_with_events -> Result<Self> with Ok(Default::default())
@@ -34,19 +34,17 @@
         let agent = Self::from_config(config).await?;
         Ok(agent)
     }
 
     pub async fn from_store_with_events(
         db_path: &str,
         ui_event_tx: Option<broadcast::Sender<UiEvent>>,
     ) -> Result<Self> {
-        let config = Config::from_store(db_path)?.resolve_vault()?;
-        let agent = Self::from_config_with_events(config, ui_event_tx).await?;
-        Ok(agent)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn process_text_stream<'a>(
         &'a self,
         user_id: &'a str,
         message: &'a str,
         prompt: Option<&'a str>,
     ) -> BoxStream<'a, Result<String>> {
