--- src/db.rs
+++ replace get_sqlcipher_key -> Result<String> with Ok("xyzzy".into())
@@ -40,28 +40,17 @@
     let mut bytes = [0u8; 32];
     let mut rng = SysRng;
     rng.try_fill_bytes(&mut bytes)
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     Ok(URL_SAFE_NO_PAD.encode(bytes))
 }
 
 pub fn get_sqlcipher_key() -> Result<String> {
-    if let Some(value) = crate::vault::get_secret(DB_KEY_NAME)? {
-        let trimmed = value.trim();
-        if !trimmed.is_empty() {
-            log_sqlcipher_key_source_once("keychain");
-            return Ok(trimmed.to_string());
-        }
-    }
-
-    let generated = generated_db_key()?;
-    crate::vault::set_secret_required(DB_KEY_NAME, &generated)?;
-    log_sqlcipher_key_source_once("generated_keychain");
-    Ok(generated)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn apply_sqlcipher_key_sync(conn: &mut SqliteConnection) -> Result<()> {
     diesel::RunQueryDsl::execute(diesel::sql_query("PRAGMA busy_timeout = 5000"), conn)
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     let key = get_sqlcipher_key()?;
     let escaped_key = key.replace('\'', "''");
     diesel::RunQueryDsl::execute(
