--- src/sandbox/mod.rs
+++ replace SandboxSettings::default_capabilities_for_tool -> Vec<String> with vec![String::new()]
@@ -106,66 +106,17 @@
         ExecutionPlan {
             runtime: ToolRuntime::Wasm,
             reason,
             tool_config,
         }
     }
 
     fn default_capabilities_for_tool(tool_name: &str) -> Vec<String> {
-        match tool_name {
-            "todo" => vec![
-                "kv.sqlite.todo.create",
-                "kv.sqlite.todo.create_many",
-                "kv.sqlite.todo.list",
-                "kv.sqlite.todo.complete",
-                "kv.sqlite.todo.reopen",
-                "kv.sqlite.todo.delete",
-                "kv.sqlite.todo.reorder",
-            ],
-            "tasks" => vec![
-                "kv.sqlite.tasks.schedule",
-                "kv.sqlite.tasks.list",
-                "kv.sqlite.tasks.enable",
-                "kv.sqlite.tasks.disable",
-                "kv.sqlite.tasks.delete",
-            ],
-            "reminders" => vec![
-                "kv.sqlite.reminders.create",
-                "kv.sqlite.reminders.list",
-                "kv.sqlite.reminders.complete",
-                "kv.sqlite.reminders.delete",
-                "kv.sqlite.reminders.snooze",
-                "kv.sqlite.reminders.clear",
-            ],
-            "planning" => vec![
-                "kv.sqlite.planning.create",
-                "kv.sqlite.planning.list",
-                "kv.sqlite.planning.get",
-                "kv.sqlite.planning.update",
-                "kv.sqlite.planning.delete",
-            ],
-            "wakeup" => vec![
-                "kv.sqlite.wakeup.create",
-                "kv.sqlite.wakeup.list",
-                "kv.sqlite.wakeup.enable",
-                "kv.sqlite.wakeup.disable",
-                "kv.sqlite.wakeup.delete",
-            ],
-            "coding" => vec!["coding.generate"],
-            "mcp" => vec!["mcp.list_tools", "mcp.call"],
-            "http_call" => vec!["http.request"],
-            "github" => vec!["github.list_tools", "github.call_tool"],
-            "zapier" => vec!["zapier.list_tools", "zapier.call_tool"],
-            "search_internet" => vec!["search.internet"],
-            _ => Vec::new(),
-        }
-        .into_iter()
-        .map(str::to_string)
-        .collect()
+        vec![String::new()] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use serde_json::json;
     use std::fs;
 
