--- src/sandbox/mod.rs
+++ delete match arm "todo" in SandboxSettings::default_capabilities_for_tool
@@ -107,25 +107,17 @@
             runtime: ToolRuntime::Wasm,
             reason,
             tool_config,
         }
     }
 
     fn default_capabilities_for_tool(tool_name: &str) -> Vec<String> {
         match tool_name {
-            "todo" => vec![
-                "kv.sqlite.todo.create",
-                "kv.sqlite.todo.create_many",
-                "kv.sqlite.todo.list",
-                "kv.sqlite.todo.complete",
-                "kv.sqlite.todo.reopen",
-                "kv.sqlite.todo.delete",
-                "kv.sqlite.todo.reorder",
-            ],
+             /* ~ changed by cargo-mutants ~ */
             "tasks" => vec![
                 "kv.sqlite.tasks.schedule",
                 "kv.sqlite.tasks.list",
                 "kv.sqlite.tasks.enable",
                 "kv.sqlite.tasks.disable",
                 "kv.sqlite.tasks.delete",
             ],
             "reminders" => vec![
