--- src/client.rs
+++ replace ButterflyBot::delete_user_history -> Result<()> with Ok(())
@@ -59,17 +59,17 @@
         user_id: &str,
         input: UserInput,
         options: ProcessOptions,
     ) -> Result<ProcessResult> {
         self.query_service.process(user_id, input, options).await
     }
 
     pub async fn delete_user_history(&self, user_id: &str) -> Result<()> {
-        self.query_service.delete_user_history(user_id).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn get_user_history(&self, user_id: &str, limit: usize) -> Result<Vec<String>> {
         self.query_service.get_user_history(user_id, limit).await
     }
 
     pub async fn search_memory(
         &self,
