--- src/client.rs
+++ replace ButterflyBot::get_user_history -> Result<Vec<String>> with Ok(vec![])
@@ -63,17 +63,17 @@
         self.query_service.process(user_id, input, options).await
     }
 
     pub async fn delete_user_history(&self, user_id: &str) -> Result<()> {
         self.query_service.delete_user_history(user_id).await
     }
 
     pub async fn get_user_history(&self, user_id: &str, limit: usize) -> Result<Vec<String>> {
-        self.query_service.get_user_history(user_id, limit).await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn search_memory(
         &self,
         user_id: &str,
         query: &str,
         limit: usize,
     ) -> Result<Vec<String>> {
