--- src/sandbox/mod.rs
+++ delete match arm "wakeup" in SandboxSettings::default_capabilities_for_tool
@@ -138,23 +138,17 @@
             ],
             "planning" => vec![
                 "kv.sqlite.planning.create",
                 "kv.sqlite.planning.list",
                 "kv.sqlite.planning.get",
                 "kv.sqlite.planning.update",
                 "kv.sqlite.planning.delete",
             ],
-            "wakeup" => vec![
-                "kv.sqlite.wakeup.create",
-                "kv.sqlite.wakeup.list",
-                "kv.sqlite.wakeup.enable",
-                "kv.sqlite.wakeup.disable",
-                "kv.sqlite.wakeup.delete",
-            ],
+             /* ~ changed by cargo-mutants ~ */
             "coding" => vec!["coding.generate"],
             "mcp" => vec!["mcp.list_tools", "mcp.call"],
             "http_call" => vec!["http.request"],
             "github" => vec!["github.list_tools", "github.call_tool"],
             "zapier" => vec!["zapier.list_tools", "zapier.call_tool"],
             "search_internet" => vec!["search.internet"],
             _ => Vec::new(),
         }
