--- src/client.rs
+++ replace ButterflyBot::search_memory -> Result<Vec<String>> with Ok(vec![])
@@ -72,19 +72,17 @@
     }
 
     pub async fn search_memory(
         &self,
         user_id: &str,
         query: &str,
         limit: usize,
     ) -> Result<Vec<String>> {
-        self.query_service
-            .search_memory(user_id, query, limit)
-            .await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn preload_context(&self, user_id: &str) -> Result<()> {
         self.query_service.preload_context(user_id).await
     }
 
     pub async fn set_heartbeat_markdown(&self, heartbeat_markdown: Option<String>) {
         let agent_service = self.query_service.agent_service();
