--- src/sandbox/mod.rs
+++ delete match arm "http_call" in SandboxSettings::default_capabilities_for_tool
@@ -147,17 +147,17 @@
                 "kv.sqlite.wakeup.create",
                 "kv.sqlite.wakeup.list",
                 "kv.sqlite.wakeup.enable",
                 "kv.sqlite.wakeup.disable",
                 "kv.sqlite.wakeup.delete",
             ],
             "coding" => vec!["coding.generate"],
             "mcp" => vec!["mcp.list_tools", "mcp.call"],
-            "http_call" => vec!["http.request"],
+             /* ~ changed by cargo-mutants ~ */
             "github" => vec!["github.list_tools", "github.call_tool"],
             "zapier" => vec!["zapier.list_tools", "zapier.call_tool"],
             "search_internet" => vec!["search.internet"],
             _ => Vec::new(),
         }
         .into_iter()
         .map(str::to_string)
         .collect()
