--- src/sandbox/mod.rs
+++ delete match arm "github" in SandboxSettings::default_capabilities_for_tool
@@ -148,17 +148,17 @@
                 "kv.sqlite.wakeup.list",
                 "kv.sqlite.wakeup.enable",
                 "kv.sqlite.wakeup.disable",
                 "kv.sqlite.wakeup.delete",
             ],
             "coding" => vec!["coding.generate"],
             "mcp" => vec!["mcp.list_tools", "mcp.call"],
             "http_call" => vec!["http.request"],
-            "github" => vec!["github.list_tools", "github.call_tool"],
+             /* ~ changed by cargo-mutants ~ */
             "zapier" => vec!["zapier.list_tools", "zapier.call_tool"],
             "search_internet" => vec!["search.internet"],
             _ => Vec::new(),
         }
         .into_iter()
         .map(str::to_string)
         .collect()
     }
