--- src/sandbox/mod.rs
+++ replace ToolRuntime::as_str -> &'static str with "xyzzy"
@@ -17,17 +17,17 @@
 #[serde(rename_all = "snake_case")]
 pub enum ToolRuntime {
     #[default]
     Wasm,
 }
 
 impl ToolRuntime {
     pub fn as_str(&self) -> &'static str {
-        "wasm"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Serialize, Deserialize, Default)]
 pub struct FilesystemPolicy {
     pub mode: Option<String>,
     #[serde(default)]
     pub allow: Vec<String>,
