--- src/config.rs
+++ replace <impl Deserialize<'de> for MarkdownSource>::deserialize -> std::result::Result<Self, D::Error> with Ok(Default::default())
@@ -116,18 +116,17 @@
     }
 }
 
 impl<'de> Deserialize<'de> for MarkdownSource {
     fn deserialize<D>(deserializer: D) -> std::result::Result<Self, D::Error>
     where
         D: Deserializer<'de>,
     {
-        let value = Value::deserialize(deserializer)?;
-        Self::from_json_value(value).map_err(de::Error::custom)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn default_heartbeat_source() -> MarkdownSource {
     MarkdownSource::default_heartbeat()
 }
 
 fn default_prompt_source() -> MarkdownSource {
