--- src/sandbox/mod.rs
+++ replace <impl Drop for TimeoutCompletion>::drop with ()
@@ -460,17 +460,17 @@
 pub struct WasmRuntime;
 
 struct TimeoutCompletion {
     done: Arc<AtomicBool>,
 }
 
 impl Drop for TimeoutCompletion {
     fn drop(&mut self) {
-        self.done.store(true, Ordering::Relaxed);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl WasmRuntime {
     const MAX_INPUT_BYTES: usize = 256 * 1024;
     const WASM_MAGIC: [u8; 4] = [0x00, 0x61, 0x73, 0x6D];
     pub const SUPPORTED_CAPABILITY_ABI_VERSION: u32 = 1;
 
