--- src/config.rs
+++ replace default_heartbeat_source -> MarkdownSource with Default::default()
@@ -122,17 +122,17 @@
         D: Deserializer<'de>,
     {
         let value = Value::deserialize(deserializer)?;
         Self::from_json_value(value).map_err(de::Error::custom)
     }
 }
 
 fn default_heartbeat_source() -> MarkdownSource {
-    MarkdownSource::default_heartbeat()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn default_prompt_source() -> MarkdownSource {
     MarkdownSource::default_prompt()
 }
 
 fn deserialize_heartbeat_source<'de, D>(
     deserializer: D,
