--- src/sandbox/mod.rs
+++ replace * with /
@@ -465,17 +465,17 @@
 
 impl Drop for TimeoutCompletion {
     fn drop(&mut self) {
         self.done.store(true, Ordering::Relaxed);
     }
 }
 
 impl WasmRuntime {
-    const MAX_INPUT_BYTES: usize = 256 * 1024;
+    const MAX_INPUT_BYTES: usize = 256 / /* ~ changed by cargo-mutants ~ */ 1024;
     const WASM_MAGIC: [u8; 4] = [0x00, 0x61, 0x73, 0x6D];
     pub const SUPPORTED_CAPABILITY_ABI_VERSION: u32 = 1;
 
     fn module_filename(tool_name: &str) -> String {
         format!("{tool_name}_tool.wasm")
     }
 
     fn candidate_wasm_roots() -> Vec<PathBuf> {
