--- src/sandbox/mod.rs
+++ replace WasmRuntime::module_filename -> String with "xyzzy".into()
@@ -470,17 +470,17 @@
 }
 
 impl WasmRuntime {
     const MAX_INPUT_BYTES: usize = 256 * 1024;
     const WASM_MAGIC: [u8; 4] = [0x00, 0x61, 0x73, 0x6D];
     pub const SUPPORTED_CAPABILITY_ABI_VERSION: u32 = 1;
 
     fn module_filename(tool_name: &str) -> String {
-        format!("{tool_name}_tool.wasm")
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     fn candidate_wasm_roots() -> Vec<PathBuf> {
         let mut roots = crate::runtime_paths::default_wasm_dir_candidates();
 
         if let Ok(exe) = std::env::current_exe() {
             if let Some(exe_dir) = exe.parent() {
                 roots.push(exe_dir.join("wasm"));
