--- src/config.rs
+++ replace deserialize_prompt_source -> std::result::Result<MarkdownSource, D::Error> with Ok(Default::default())
@@ -148,21 +148,17 @@
 }
 
 fn deserialize_prompt_source<'de, D>(
     deserializer: D,
 ) -> std::result::Result<MarkdownSource, D::Error>
 where
     D: Deserializer<'de>,
 {
-    let value = Option::<Value>::deserialize(deserializer)?;
-    match value {
-        None | Some(Value::Null) => Ok(default_prompt_source()),
-        Some(value) => MarkdownSource::from_json_value(value).map_err(de::Error::custom),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Deserialize, Serialize)]
 pub struct Config {
     pub openai: Option<OpenAiConfig>,
     #[serde(
         default = "default_heartbeat_source",
         alias = "heartbeat_file",
