--- src/sandbox/mod.rs
+++ replace WasmRuntime::default_module_path -> String with String::new()
@@ -501,27 +501,17 @@
             if !deduped.contains(&root) {
                 deduped.push(root);
             }
         }
         deduped
     }
 
     fn default_module_path(tool_name: &str) -> String {
-        let file_name = Self::module_filename(tool_name);
-        let fallback = PathBuf::from(".").join("wasm").join(&file_name);
-
-        for root in Self::candidate_wasm_roots() {
-            let candidate = root.join(&file_name);
-            if candidate.exists() {
-                return candidate.to_string_lossy().to_string();
-            }
-        }
-
-        fallback.to_string_lossy().to_string()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn resolve_module_path(tool_name: &str, config: &ToolSandboxConfig) -> String {
         let default_path = Self::default_module_path(tool_name);
         config
             .wasm
             .module
             .as_deref()
