--- src/config.rs
+++ replace Config::resolve_vault -> Result<Self> with Ok(Default::default())
@@ -253,27 +253,11 @@
                 }
 
                 Err(store_err)
             }
         }
     }
 
     pub fn resolve_vault(mut self) -> Result<Self> {
-        if let Some(openai) = &mut self.openai {
-            if openai.api_key.is_none() {
-                if let Some(secret) = crate::vault::get_secret("openai_api_key")? {
-                    openai.api_key = Some(secret);
-                }
-            }
-        }
-        if let Some(memory) = &mut self.memory {
-            if let Some(openai) = &mut memory.openai {
-                if openai.api_key.is_none() {
-                    if let Some(secret) = crate::vault::get_secret("memory_openai_api_key")? {
-                        openai.api_key = Some(secret);
-                    }
-                }
-            }
-        }
-        Ok(self)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
