--- src/sandbox/mod.rs
+++ replace WasmRuntime::resolve_module_path -> String with String::new()
@@ -515,43 +515,17 @@
                 return candidate.to_string_lossy().to_string();
             }
         }
 
         fallback.to_string_lossy().to_string()
     }
 
     fn resolve_module_path(tool_name: &str, config: &ToolSandboxConfig) -> String {
-        let default_path = Self::default_module_path(tool_name);
-        config
-            .wasm
-            .module
-            .as_deref()
-            .map(str::trim)
-            .filter(|v| !v.is_empty())
-            .map(|configured| {
-                let configured_path = configured.to_string();
-                let configured_file = Path::new(configured)
-                    .file_name()
-                    .and_then(|name| name.to_str())
-                    .unwrap_or_default();
-
-                if configured_file == "butterfly_bot_wasm_tool.wasm" {
-                    return default_path.clone();
-                }
-
-                if Path::new(&configured_path).exists() {
-                    configured_path
-                } else if Path::new(&default_path).exists() {
-                    default_path.clone()
-                } else {
-                    configured_path
-                }
-            })
-            .unwrap_or(default_path)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn resolve_entrypoint(config: &ToolSandboxConfig) -> String {
         config
             .wasm
             .entrypoint
             .as_deref()
             .map(str::trim)
