--- src/config.rs
+++ replace MarkdownSource::as_url -> Option<&str> with Some("")
@@ -40,20 +40,17 @@
 
     pub fn default_prompt() -> Self {
         Self::Database {
             markdown: "# Prompt\n\nAnswer directly, include concrete actions, and keep responses practical.".to_string(),
         }
     }
 
     pub fn as_url(&self) -> Option<&str> {
-        match self {
-            Self::Url { url } => Some(url.as_str()),
-            Self::Database { .. } => None,
-        }
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn as_database_markdown(&self) -> Option<&str> {
         match self {
             Self::Url { .. } => None,
             Self::Database { markdown } => Some(markdown.as_str()),
         }
     }
