--- src/config.rs
+++ replace MarkdownSource::as_database_markdown -> Option<&str> with None
@@ -47,20 +47,17 @@
     pub fn as_url(&self) -> Option<&str> {
         match self {
             Self::Url { url } => Some(url.as_str()),
             Self::Database { .. } => None,
         }
     }
 
     pub fn as_database_markdown(&self) -> Option<&str> {
-        match self {
-            Self::Url { .. } => None,
-            Self::Database { markdown } => Some(markdown.as_str()),
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn from_legacy_string(value: String) -> Self {
         let trimmed = value.trim();
         if trimmed.starts_with("http://") || trimmed.starts_with("https://") {
             return Self::Url {
                 url: trimmed.to_string(),
             };
