--- src/sandbox/mod.rs
+++ replace > with < in WasmRuntime::resolve_fuel_limit
@@ -556,17 +556,17 @@
             .as_deref()
             .map(str::trim)
             .filter(|v| !v.is_empty())
             .unwrap_or("execute")
             .to_string()
     }
 
     fn resolve_fuel_limit(config: &ToolSandboxConfig) -> Option<u64> {
-        config.wasm.fuel.filter(|limit| *limit > 0)
+        config.wasm.fuel.filter(|limit| *limit < /* ~ changed by cargo-mutants ~ */ 0)
     }
 
     pub fn validate_module_binary(tool_name: &str, config: &ToolSandboxConfig) -> Result<()> {
         let module_path = Self::resolve_module_path(tool_name, config);
         let path = Path::new(&module_path);
 
         if !path.exists() {
             return Err(ButterflyBotError::Runtime(format!(
