--- src/config.rs
+++ replace MarkdownSource::from_legacy_string -> Self with Default::default()
@@ -54,24 +54,17 @@
     pub fn as_database_markdown(&self) -> Option<&str> {
         match self {
             Self::Url { .. } => None,
             Self::Database { markdown } => Some(markdown.as_str()),
         }
     }
 
     fn from_legacy_string(value: String) -> Self {
-        let trimmed = value.trim();
-        if trimmed.starts_with("http://") || trimmed.starts_with("https://") {
-            return Self::Url {
-                url: trimmed.to_string(),
-            };
-        }
-        let markdown = fs::read_to_string(trimmed).unwrap_or_default();
-        Self::Database { markdown }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn from_json_value(value: Value) -> std::result::Result<Self, String> {
         match value {
             Value::String(raw) => Ok(Self::from_legacy_string(raw)),
             Value::Object(map) => {
                 if let Some(kind) = map.get("type").and_then(|v| v.as_str()) {
                     match kind {
