--- src/sandbox/mod.rs
+++ delete ! in WasmRuntime::validate_module_binary
@@ -563,17 +563,17 @@
     fn resolve_fuel_limit(config: &ToolSandboxConfig) -> Option<u64> {
         config.wasm.fuel.filter(|limit| *limit > 0)
     }
 
     pub fn validate_module_binary(tool_name: &str, config: &ToolSandboxConfig) -> Result<()> {
         let module_path = Self::resolve_module_path(tool_name, config);
         let path = Path::new(&module_path);
 
-        if !path.exists() {
+        if  /* ~ changed by cargo-mutants ~ */path.exists() {
             return Err(ButterflyBotError::Runtime(format!(
                 "WASM module path does not exist for tool '{tool_name}': {module_path}"
             )));
         }
 
         let mut file = File::open(path)
             .map_err(|e| ButterflyBotError::Runtime(format!("Failed to open wasm module: {e}")))?;
         let mut header = [0u8; 4];
