--- src/config_store.rs
+++ replace save_config -> Result<()> with Ok(())
@@ -55,31 +55,10 @@
     let value: Value = serde_json::from_str(&row.config_json)
         .map_err(|e| ButterflyBotError::Config(e.to_string()))?;
     let config: Config =
         serde_json::from_value(value).map_err(|e| ButterflyBotError::Config(e.to_string()))?;
     Ok(config)
 }
 
 pub fn save_config(db_path: &str, config: &Config) -> Result<()> {
-    ensure_parent_dir(db_path)?;
-    let mut conn = open_conn(db_path)?;
-    ensure_table(&mut conn)?;
-
-    let ts = SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?
-        .as_secs() as i64;
-    let config_json =
-        serde_json::to_string(config).map_err(|e| ButterflyBotError::Config(e.to_string()))?;
-
-    diesel::sql_query(
-        "INSERT INTO app_config (id, config_json, updated_at)
-         VALUES (1, ?1, ?2)
-         ON CONFLICT(id) DO UPDATE SET config_json = excluded.config_json, updated_at = excluded.updated_at",
-    )
-    .bind::<Text, _>(config_json)
-    .bind::<diesel::sql_types::BigInt, _>(ts)
-    .execute(&mut conn)
-    .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
