--- src/sandbox/mod.rs
+++ replace WasmRuntime::validate_capability_abi -> Result<()> with Ok(())
@@ -606,26 +606,17 @@
                 "WASM module for tool '{tool_name}' at {module_path} is a placeholder stub. Build/install a real WASM implementation before starting the daemon."
             )));
         }
 
         Ok(())
     }
 
     pub fn validate_capability_abi(tool_name: &str, config: &ToolSandboxConfig) -> Result<()> {
-        if let Some(version) = config.capabilities.abi_version {
-            if version != Self::SUPPORTED_CAPABILITY_ABI_VERSION {
-                return Err(ButterflyBotError::Runtime(format!(
-                    "Tool '{tool_name}' uses unsupported capability ABI version {version}; supported version is {}",
-                    Self::SUPPORTED_CAPABILITY_ABI_VERSION
-                )));
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn split_ptr_len(packed: i64) -> Result<(i32, i32)> {
         let raw = packed as u64;
         let ptr = (raw >> 32) as u32;
         let len = (raw & 0xFFFF_FFFF) as u32;
         let ptr = i32::try_from(ptr).map_err(|_| {
             ButterflyBotError::Runtime("Invalid output pointer from wasm".to_string())
