--- src/sandbox/mod.rs
+++ replace != with == in WasmRuntime::validate_capability_abi
@@ -607,17 +607,17 @@
             )));
         }
 
         Ok(())
     }
 
     pub fn validate_capability_abi(tool_name: &str, config: &ToolSandboxConfig) -> Result<()> {
         if let Some(version) = config.capabilities.abi_version {
-            if version != Self::SUPPORTED_CAPABILITY_ABI_VERSION {
+            if version == /* ~ changed by cargo-mutants ~ */ Self::SUPPORTED_CAPABILITY_ABI_VERSION {
                 return Err(ButterflyBotError::Runtime(format!(
                     "Tool '{tool_name}' uses unsupported capability ABI version {version}; supported version is {}",
                     Self::SUPPORTED_CAPABILITY_ABI_VERSION
                 )));
             }
         }
 
         Ok(())
