--- src/daemon.rs
+++ replace write_ui_event_log -> Result<()> with Ok(())
@@ -1964,26 +1964,17 @@
         .and_then(|settings| settings.get("ui_event_log_path"))
         .and_then(|value| value.as_str())
         .map(|value| value.trim().to_string())
         .filter(|value| !value.is_empty())
         .or_else(|| Some("./data/ui_events.log".to_string()))
 }
 
 fn write_ui_event_log(path: &str, event: &UiEvent) -> Result<()> {
-    config_store::ensure_parent_dir(path)?;
-    let payload = serde_json::to_string(event)
-        .map_err(|e| ButterflyBotError::Serialization(e.to_string()))?;
-    let mut file = std::fs::OpenOptions::new()
-        .create(true)
-        .append(true)
-        .open(path)
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    writeln!(file, "{}", payload).map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn tasks_audit_log_path(config: Option<&Config>) -> Option<String> {
     let path = config
         .and_then(|cfg| cfg.tools.as_ref())
         .and_then(|tools| tools.get("tasks"))
         .and_then(|tasks| tasks.get("audit_log_path"))
         .and_then(|value| value.as_str())
