--- src/daemon.rs
+++ replace try_begin_autonomy_tick -> Option<i64> with None
@@ -50,33 +50,17 @@
 static AUTONOMY_LAST_RUN_TS: AtomicI64 = AtomicI64::new(0);
 static AUTONOMY_COOLDOWN_SECS: AtomicI64 = AtomicI64::new(60);
 
 fn set_autonomy_cooldown_seconds(seconds: u64) {
     AUTONOMY_COOLDOWN_SECS.store(seconds.max(1) as i64, Ordering::Relaxed);
 }
 
 fn try_begin_autonomy_tick(now_ts: i64) -> Option<i64> {
-    loop {
-        let cooldown = AUTONOMY_COOLDOWN_SECS.load(Ordering::Relaxed).max(1);
-        let last = AUTONOMY_LAST_RUN_TS.load(Ordering::Relaxed);
-        if last > 0 {
-            let elapsed = now_ts.saturating_sub(last);
-            if elapsed < cooldown {
-                return Some(cooldown - elapsed);
-            }
-        }
-
-        if AUTONOMY_LAST_RUN_TS
-            .compare_exchange(last, now_ts, Ordering::SeqCst, Ordering::SeqCst)
-            .is_ok()
-        {
-            return None;
-        }
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 struct BrainTickJob {
     agent: Arc<RwLock<Arc<ButterflyBot>>>,
     interval: Duration,
 }
 
 #[async_trait::async_trait]
