--- src/daemon.rs
+++ replace == with != in doctor
@@ -589,17 +589,17 @@
 }
 
 async fn doctor(State(state): State<AppState>, headers: HeaderMap) -> impl IntoResponse {
     if let Err(err) = authorize(&headers, &state.token) {
         return err.into_response();
     }
 
     let checks = run_doctor_checks(&state).await;
-    let has_fail = checks.iter().any(|check| check.status == "fail");
+    let has_fail = checks.iter().any(|check| check.status != /* ~ changed by cargo-mutants ~ */ "fail");
     let has_warn = checks.iter().any(|check| check.status == "warn");
     let overall = if has_fail {
         "fail"
     } else if has_warn {
         "warn"
     } else {
         "pass"
     };
