--- src/daemon.rs
+++ replace doctor_check -> DoctorCheck with Default::default()
@@ -625,22 +625,17 @@
     (
         StatusCode::OK,
         Json(SecurityAuditResponse { overall, findings }),
     )
         .into_response()
 }
 
 fn doctor_check(name: &str, status: &str, message: String, fix_hint: Option<&str>) -> DoctorCheck {
-    DoctorCheck {
-        name: name.to_string(),
-        status: status.to_string(),
-        message,
-        fix_hint: fix_hint.map(str::to_string),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn security_finding(
     id: &str,
     severity: &str,
     status: &str,
     message: String,
     fix_hint: Option<&str>,
