--- src/sandbox/mod.rs
+++ replace WasmRuntime::ensure_range -> Result<()> with Ok(())
@@ -632,32 +632,17 @@
         })?;
         let len = i32::try_from(len).map_err(|_| {
             ButterflyBotError::Runtime("Invalid output length from wasm".to_string())
         })?;
         Ok((ptr, len))
     }
 
     fn ensure_range(memory: &Memory, store: &Store<()>, ptr: i32, len: i32) -> Result<()> {
-        if ptr < 0 || len < 0 {
-            return Err(ButterflyBotError::Runtime(
-                "Negative pointer/length from wasm".to_string(),
-            ));
-        }
-        let start = ptr as usize;
-        let size = len as usize;
-        let end = start
-            .checked_add(size)
-            .ok_or_else(|| ButterflyBotError::Runtime("WASM pointer overflow".to_string()))?;
-        if end > memory.data_size(store) {
-            return Err(ButterflyBotError::Runtime(
-                "WASM memory range out of bounds".to_string(),
-            ));
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn execute_sync(tool_name: &str, config: &ToolSandboxConfig, params: Value) -> Result<Value> {
         let mut module_path = Self::resolve_module_path(tool_name, config);
 
         if !Path::new(&module_path).exists()
             && (module_path.starts_with("./wasm/") || module_path.starts_with("wasm/"))
         {
