--- src/sandbox/mod.rs
+++ replace > with >= in WasmRuntime::ensure_range
@@ -642,17 +642,17 @@
                 "Negative pointer/length from wasm".to_string(),
             ));
         }
         let start = ptr as usize;
         let size = len as usize;
         let end = start
             .checked_add(size)
             .ok_or_else(|| ButterflyBotError::Runtime("WASM pointer overflow".to_string()))?;
-        if end > memory.data_size(store) {
+        if end >= /* ~ changed by cargo-mutants ~ */ memory.data_size(store) {
             return Err(ButterflyBotError::Runtime(
                 "WASM memory range out of bounds".to_string(),
             ));
         }
         Ok(())
     }
 
     fn execute_sync(tool_name: &str, config: &ToolSandboxConfig, params: Value) -> Result<Value> {
