--- src/daemon.rs
+++ delete match arm "medium" in severity_rank
@@ -655,17 +655,17 @@
         auto_fixable,
     }
 }
 
 fn severity_rank(severity: &str) -> u8 {
     match severity {
         "critical" => 4,
         "high" => 3,
-        "medium" => 2,
+         /* ~ changed by cargo-mutants ~ */
         _ => 1,
     }
 }
 
 fn highest_severity(findings: &[SecurityAuditFinding]) -> String {
     findings
         .iter()
         .filter(|finding| finding.status != "pass")
