--- src/sandbox/mod.rs
+++ delete ! in WasmRuntime::execute_sync
@@ -653,17 +653,17 @@
             ));
         }
         Ok(())
     }
 
     fn execute_sync(tool_name: &str, config: &ToolSandboxConfig, params: Value) -> Result<Value> {
         let mut module_path = Self::resolve_module_path(tool_name, config);
 
-        if !Path::new(&module_path).exists()
+        if  /* ~ changed by cargo-mutants ~ */Path::new(&module_path).exists()
             && (module_path.starts_with("./wasm/") || module_path.starts_with("wasm/"))
         {
             if let Ok(wasm_dir) = crate::wasm_bundle::ensure_bundled_wasm_tools() {
                 let candidate = wasm_dir.join(Self::module_filename(tool_name));
                 if candidate.exists() {
                     module_path = candidate.to_string_lossy().to_string();
                 }
             }
