--- src/daemon.rs
+++ replace highest_severity -> String with "xyzzy".into()
@@ -661,22 +661,17 @@
         "critical" => 4,
         "high" => 3,
         "medium" => 2,
         _ => 1,
     }
 }
 
 fn highest_severity(findings: &[SecurityAuditFinding]) -> String {
-    findings
-        .iter()
-        .filter(|finding| finding.status != "pass")
-        .max_by_key(|finding| severity_rank(&finding.severity))
-        .map(|finding| finding.severity.clone())
-        .unwrap_or_else(|| "low".to_string())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 async fn run_security_audit_checks(state: &AppState) -> Vec<SecurityAuditFinding> {
     let mut findings = Vec::new();
 
     if state.token.trim().is_empty() {
         findings.push(security_finding(
             "daemon_auth_token",
