--- src/sandbox/mod.rs
+++ delete ! in WasmRuntime::execute_sync
@@ -666,17 +666,17 @@
                 if candidate.exists() {
                     module_path = candidate.to_string_lossy().to_string();
                 }
             }
         }
 
         tracing::info!(tool = %tool_name, module_path = %module_path, "Executing tool in WASM runtime");
 
-        if !Path::new(&module_path).exists() {
+        if  /* ~ changed by cargo-mutants ~ */Path::new(&module_path).exists() {
             return Err(ButterflyBotError::Runtime(format!(
                 "WASM module path does not exist for tool '{tool_name}': {module_path}"
             )));
         }
 
         let entrypoint = Self::resolve_entrypoint(config);
         let timeout_ms = config.wasm.timeout_ms.unwrap_or(0);
         let fuel_limit = Self::resolve_fuel_limit(config);
