--- src/daemon.rs
+++ replace <impl ScheduledJob for BrainTickJob>::name -> &str with ""
@@ -77,17 +77,17 @@
 struct BrainTickJob {
     agent: Arc<RwLock<Arc<ButterflyBot>>>,
     interval: Duration,
 }
 
 #[async_trait::async_trait]
 impl ScheduledJob for BrainTickJob {
     fn name(&self) -> &str {
-        "brain_tick"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn interval(&self) -> Duration {
         self.interval
     }
 
     async fn run(&self) -> Result<()> {
         let agent = self.agent.read().await.clone();
