--- src/sandbox/mod.rs
+++ replace > with == in WasmRuntime::execute_sync
@@ -698,17 +698,17 @@
         let mut store = Store::new(&engine, ());
 
         if let Some(limit) = fuel_limit {
             store.set_fuel(limit).map_err(|e| {
                 ButterflyBotError::Runtime(format!("Failed to apply wasm fuel limit: {e}"))
             })?;
         }
 
-        let _timeout_guard = if timeout_ms > 0 {
+        let _timeout_guard = if timeout_ms == /* ~ changed by cargo-mutants ~ */ 0 {
             store.set_epoch_deadline(1);
             let done = Arc::new(AtomicBool::new(false));
             let done_for_thread = done.clone();
             let engine_for_thread = engine.clone();
             std::thread::spawn(move || {
                 std::thread::sleep(Duration::from_millis(timeout_ms));
                 if !done_for_thread.load(Ordering::Relaxed) {
                     engine_for_thread.increment_epoch();
