--- src/db.rs
+++ replace generated_db_key -> Result<String> with Ok("xyzzy".into())
@@ -32,21 +32,17 @@
 fn log_sqlcipher_key_source_once(source: &str) {
     static LOGGED: OnceLock<()> = OnceLock::new();
     if LOGGED.set(()).is_ok() {
         tracing::info!(db_key_source = source, "Resolved SQLCipher key source");
     }
 }
 
 fn generated_db_key() -> Result<String> {
-    let mut bytes = [0u8; 32];
-    let mut rng = SysRng;
-    rng.try_fill_bytes(&mut bytes)
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    Ok(URL_SAFE_NO_PAD.encode(bytes))
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn get_sqlcipher_key() -> Result<String> {
     if let Some(value) = crate::vault::get_secret(DB_KEY_NAME)? {
         let trimmed = value.trim();
         if !trimmed.is_empty() {
             log_sqlcipher_key_source_once("keychain");
             return Ok(trimmed.to_string());
