--- src/main.rs
+++ replace install_ollama_if_missing -> Result<()> with Ok(())
@@ -107,40 +107,17 @@
         return Ok(());
     }
     install_ollama_if_missing()
 }
 
 #[cfg(not(test))]
 #[cfg(any(target_os = "linux", target_os = "macos"))]
 fn install_ollama_if_missing() -> Result<()> {
-    if ollama_available() {
-        return Ok(());
-    }
-
-    println!("Ollama not found. Installing Ollama...");
-    let status = Command::new("sh")
-        .arg("-c")
-        .arg("curl -fsSL https://ollama.com/install.sh | sh")
-        .status()
-        .map_err(|e| butterfly_bot::error::ButterflyBotError::Runtime(e.to_string()))?;
-
-    if !status.success() {
-        return Err(butterfly_bot::error::ButterflyBotError::Runtime(
-            "Automatic Ollama installation failed".to_string(),
-        ));
-    }
-    if !ollama_available() {
-        return Err(butterfly_bot::error::ButterflyBotError::Runtime(
-            "Ollama installation finished but 'ollama' is still not available".to_string(),
-        ));
-    }
-
-    println!("Ollama installed successfully.");
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(test))]
 #[cfg(not(any(target_os = "linux", target_os = "macos")))]
 fn install_ollama_if_missing() -> Result<()> {
     Ok(())
 }
 
