--- src/main.rs
+++ delete ! in install_ollama_if_missing
@@ -123,17 +123,17 @@
         .status()
         .map_err(|e| butterfly_bot::error::ButterflyBotError::Runtime(e.to_string()))?;
 
     if !status.success() {
         return Err(butterfly_bot::error::ButterflyBotError::Runtime(
             "Automatic Ollama installation failed".to_string(),
         ));
     }
-    if !ollama_available() {
+    if  /* ~ changed by cargo-mutants ~ */ollama_available() {
         return Err(butterfly_bot::error::ButterflyBotError::Runtime(
             "Ollama installation finished but 'ollama' is still not available".to_string(),
         ));
     }
 
     println!("Ollama installed successfully.");
     Ok(())
 }
