--- src/main.rs
+++ delete ! in ensure_ollama_models
@@ -166,17 +166,17 @@
         return Ok(());
     }
     let Some(openai) = &config.openai else {
         return Ok(());
     };
 
     let mut required = Vec::new();
     if let Some(model) = &openai.model {
-        if !model.trim().is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */model.trim().is_empty() {
             required.push(model.clone());
         }
     }
     if let Some(memory) = &config.memory {
         for value in [
             memory.embedding_model.as_ref(),
             memory.rerank_model.as_ref(),
             memory.summary_model.as_ref(),
