--- src/main.rs
+++ delete ! in ensure_ollama_models
@@ -179,17 +179,17 @@
         for value in [
             memory.embedding_model.as_ref(),
             memory.rerank_model.as_ref(),
             memory.summary_model.as_ref(),
         ]
         .into_iter()
         .flatten()
         {
-            if !value.trim().is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */value.trim().is_empty() {
                 required.push(value.clone());
             }
         }
     }
 
     required.sort();
     required.dedup();
     if required.is_empty() {
