--- src/sandbox/mod.rs
+++ replace > with >= in WasmRuntime::execute_sync
@@ -771,17 +771,17 @@
 
         Self::ensure_range(&memory, &store, input_ptr, input_len)?;
         memory
             .write(&mut store, input_ptr as usize, &input)
             .map_err(|e| ButterflyBotError::Runtime(format!("WASM memory write failed: {e}")))?;
 
         let packed = exec.call(&mut store, (input_ptr, input_len)).map_err(|e| {
             let msg = e.to_string();
-            if timeout_ms > 0 && msg.to_ascii_lowercase().contains("interrupt") {
+            if timeout_ms >= /* ~ changed by cargo-mutants ~ */ 0 && msg.to_ascii_lowercase().contains("interrupt") {
                 ButterflyBotError::Runtime(format!(
                     "WASM tool '{tool_name}' timed out after {timeout_ms}ms"
                 ))
             } else {
                 ButterflyBotError::Runtime(format!("WASM tool execute failed: {msg}"))
             }
         })?;
 
