--- src/sandbox/mod.rs
+++ replace SandboxSettings::from_root_config -> Self with Default::default()
@@ -79,26 +79,17 @@
 #[derive(Debug, Clone, Serialize, Deserialize, Default)]
 pub struct SandboxSettings {
     #[serde(default)]
     pub tools: HashMap<String, ToolSandboxConfig>,
 }
 
 impl SandboxSettings {
     pub fn from_root_config(root: &Value) -> Self {
-        let candidate = root
-            .get("tools")
-            .and_then(|v| v.get("settings"))
-            .and_then(|v| v.get("sandbox"))
-            .cloned();
-
-        match candidate {
-            Some(value) => serde_json::from_value(value).unwrap_or_default(),
-            None => SandboxSettings::default(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn execution_plan(&self, tool_name: &str) -> ExecutionPlan {
         let mut tool_config = self.tools.get(tool_name).cloned().unwrap_or_default();
         if tool_config.capabilities.allow.is_empty() {
             tool_config.capabilities.allow = Self::default_capabilities_for_tool(tool_name);
         }
         let reason = "wasm_only_policy".to_string();
