--- src/main.rs
+++ replace list_ollama_models -> Result<Vec<String>> with Ok(vec!["xyzzy".into()])
@@ -217,39 +217,17 @@
 
 #[cfg(not(test))]
 fn is_ollama_local(base_url: &str) -> bool {
     base_url.starts_with("http://localhost:11434") || base_url.starts_with("http://127.0.0.1:11434")
 }
 
 #[cfg(not(test))]
 fn list_ollama_models() -> Result<Vec<String>> {
-    let output = Command::new("ollama").arg("list").output().map_err(|e| {
-        if e.kind() == ErrorKind::NotFound {
-            butterfly_bot::error::ButterflyBotError::Runtime(
-                "ollama binary not found in runtime environment".to_string(),
-            )
-        } else {
-            butterfly_bot::error::ButterflyBotError::Runtime(e.to_string())
-        }
-    })?;
-    if !output.status.success() {
-        return Err(butterfly_bot::error::ButterflyBotError::Runtime(
-            String::from_utf8_lossy(&output.stderr).to_string(),
-        ));
-    }
-    let stdout = String::from_utf8_lossy(&output.stdout);
-    let mut models = Vec::new();
-    for line in stdout.lines().skip(1) {
-        let name = line.split_whitespace().next().unwrap_or("");
-        if !name.is_empty() {
-            models.push(name.to_string());
-        }
-    }
-    Ok(models)
+    Ok(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(test))]
 fn pull_ollama_model(model: &str) -> Result<()> {
     let status = Command::new("ollama")
         .arg("pull")
         .arg(model)
         .status()
