--- src/main.rs
+++ replace == with != in list_ollama_models
@@ -218,17 +218,17 @@
 #[cfg(not(test))]
 fn is_ollama_local(base_url: &str) -> bool {
     base_url.starts_with("http://localhost:11434") || base_url.starts_with("http://127.0.0.1:11434")
 }
 
 #[cfg(not(test))]
 fn list_ollama_models() -> Result<Vec<String>> {
     let output = Command::new("ollama").arg("list").output().map_err(|e| {
-        if e.kind() == ErrorKind::NotFound {
+        if e.kind() != /* ~ changed by cargo-mutants ~ */ ErrorKind::NotFound {
             butterfly_bot::error::ButterflyBotError::Runtime(
                 "ollama binary not found in runtime environment".to_string(),
             )
         } else {
             butterfly_bot::error::ButterflyBotError::Runtime(e.to_string())
         }
     })?;
     if !output.status.success() {
