--- src/main.rs
+++ delete ! in list_ollama_models
@@ -235,17 +235,17 @@
         return Err(butterfly_bot::error::ButterflyBotError::Runtime(
             String::from_utf8_lossy(&output.stderr).to_string(),
         ));
     }
     let stdout = String::from_utf8_lossy(&output.stdout);
     let mut models = Vec::new();
     for line in stdout.lines().skip(1) {
         let name = line.split_whitespace().next().unwrap_or("");
-        if !name.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */name.is_empty() {
             models.push(name.to_string());
         }
     }
     Ok(models)
 }
 
 #[cfg(not(test))]
 fn pull_ollama_model(model: &str) -> Result<()> {
