--- src/ui.rs
+++ replace match guard !secret.trim().is_empty() with true in app_view
@@ -2040,17 +2040,17 @@
 
                 let provider_name = search_provider();
                 let secret_name = match provider_name.as_str() {
                     "perplexity" => "search_internet_perplexity_api_key",
                     "grok" => "search_internet_grok_api_key",
                     _ => "search_internet_openai_api_key",
                 };
                 match crate::vault::get_secret(secret_name) {
-                    Ok(Some(secret)) if !secret.trim().is_empty() => {
+                    Ok(Some(secret)) if true /* ~ changed by cargo-mutants ~ */ => {
                         search_api_key_input.set(secret);
                         search_api_key_status.set("Stored in vault".to_string());
                     }
                     Ok(_) => {
                         let fallback = config
                             .tools
                             .as_ref()
                             .and_then(|tools| tools.get("search_internet"))
