--- src/ui.rs
+++ replace env_auth_token -> String with "xyzzy".into()
@@ -599,17 +599,17 @@
         shutdown: shutdown_tx,
         thread,
     });
 
     Ok(())
 }
 
 fn env_auth_token() -> String {
-    crate::vault::ensure_daemon_auth_token().unwrap_or_default()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn stop_local_daemon() -> Result<(), String> {
     let control = daemon_control();
     let mut guard = control
         .lock()
         .map_err(|_| "Daemon lock unavailable".to_string())?;
     if let Some(control) = guard.take() {
