--- src/daemon.rs
+++ replace authorize -> std::result::Result<(), (StatusCode, Json<ErrorResponse>)> with Ok(())
@@ -1607,47 +1607,17 @@
         .body(body)
         .unwrap()
 }
 
 fn authorize(
     headers: &HeaderMap,
     token: &str,
 ) -> std::result::Result<(), (StatusCode, Json<ErrorResponse>)> {
-    let expected_token = token.trim();
-    if expected_token.is_empty() {
-        return Err((
-            StatusCode::UNAUTHORIZED,
-            Json(ErrorResponse {
-                error: "Unauthorized".to_string(),
-            }),
-        ));
-    }
-
-    let header = headers
-        .get("authorization")
-        .and_then(|value| value.to_str().ok())
-        .unwrap_or_default();
-    let api_key = headers
-        .get("x-api-key")
-        .and_then(|value| value.to_str().ok())
-        .unwrap_or_default();
-    let bearer = header.strip_prefix("Bearer ").unwrap_or("").trim();
-    let api_key = api_key.trim();
-
-    if bearer == expected_token || api_key == expected_token {
-        Ok(())
-    } else {
-        Err((
-            StatusCode::UNAUTHORIZED,
-            Json(ErrorResponse {
-                error: "Unauthorized".to_string(),
-            }),
-        ))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn run(host: &str, port: u16, db_path: &str, token: &str) -> Result<()> {
     run_with_shutdown(host, port, db_path, token, futures::future::pending::<()>()).await
 }
 
 pub async fn run_with_shutdown<F>(
     host: &str,
