--- src/daemon.rs
+++ replace == with != in authorize
@@ -1628,17 +1628,17 @@
         .unwrap_or_default();
     let api_key = headers
         .get("x-api-key")
         .and_then(|value| value.to_str().ok())
         .unwrap_or_default();
     let bearer = header.strip_prefix("Bearer ").unwrap_or("").trim();
     let api_key = api_key.trim();
 
-    if bearer == expected_token || api_key == expected_token {
+    if bearer != /* ~ changed by cargo-mutants ~ */ expected_token || api_key == expected_token {
         Ok(())
     } else {
         Err((
             StatusCode::UNAUTHORIZED,
             Json(ErrorResponse {
                 error: "Unauthorized".to_string(),
             }),
         ))
