--- src/daemon.rs
+++ replace wakeup_audit_log_path -> Option<String> with Some(String::new())
@@ -1909,25 +1909,17 @@
 fn now_ts() -> i64 {
     SystemTime::now()
         .duration_since(UNIX_EPOCH)
         .unwrap_or_default()
         .as_secs() as i64
 }
 
 fn wakeup_audit_log_path(config: Option<&Config>) -> Option<String> {
-    let path = config
-        .and_then(|cfg| cfg.tools.as_ref())
-        .and_then(|tools| tools.get("wakeup"))
-        .and_then(|wakeup| wakeup.get("audit_log_path"))
-        .and_then(|value| value.as_str())
-        .map(|value| value.trim().to_string())
-        .filter(|value| !value.is_empty())
-        .or_else(|| Some("./data/wakeup_audit.log".to_string()));
-    path
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_wakeup_audit_log(
     path: Option<&str>,
     ts: i64,
     task: &crate::wakeup::WakeupTask,
     status: &str,
     payload: serde_json::Value,
