--- src/main.rs
+++ delete ! in split_model_name
@@ -272,17 +272,17 @@
 }
 
 #[cfg(not(test))]
 fn split_model_name(model: &str) -> (String, Option<String>) {
     let mut parts = model.rsplitn(2, ':');
     let tag = parts.next().map(|v| v.to_string());
     let base = parts.next();
     match base {
-        Some(base) if !base.is_empty() => (base.to_string(), tag),
+        Some(base) if  /* ~ changed by cargo-mutants ~ */base.is_empty() => (base.to_string(), tag),
         _ => (model.to_string(), None),
     }
 }
 
 #[cfg(not(test))]
 fn model_matches(required: &str, installed: &str) -> bool {
     let (req_base, req_tag) = split_model_name(required);
     let (ins_base, ins_tag) = split_model_name(installed);
