--- src/daemon.rs
+++ replace write_wakeup_audit_log -> Result<()> with Ok(())
@@ -1927,39 +1927,17 @@
 
 fn write_wakeup_audit_log(
     path: Option<&str>,
     ts: i64,
     task: &crate::wakeup::WakeupTask,
     status: &str,
     payload: serde_json::Value,
 ) -> Result<()> {
-    let Some(path) = path else {
-        return Ok(());
-    };
-    config_store::ensure_parent_dir(path)?;
-    let mut file = std::fs::OpenOptions::new()
-        .create(true)
-        .append(true)
-        .open(path)
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    let entry = serde_json::json!({
-        "timestamp": ts,
-        "task_id": task.id,
-        "user_id": task.user_id,
-        "name": task.name,
-        "prompt": task.prompt,
-        "status": status,
-        "payload": payload,
-    });
-    let line = serde_json::to_string(&entry)
-        .map_err(|e| ButterflyBotError::Serialization(e.to_string()))?;
-    use std::io::Write;
-    writeln!(file, "{line}").map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn ui_event_log_path(config: Option<&Config>) -> Option<String> {
     config
         .and_then(|cfg| cfg.tools.as_ref())
         .and_then(|tools| tools.get("settings"))
         .and_then(|settings| settings.get("ui_event_log_path"))
         .and_then(|value| value.as_str())
