--- src/main.rs
+++ replace model_matches -> bool with false
@@ -279,27 +279,17 @@
     match base {
         Some(base) if !base.is_empty() => (base.to_string(), tag),
         _ => (model.to_string(), None),
     }
 }
 
 #[cfg(not(test))]
 fn model_matches(required: &str, installed: &str) -> bool {
-    let (req_base, req_tag) = split_model_name(required);
-    let (ins_base, ins_tag) = split_model_name(installed);
-    if req_base != ins_base {
-        return false;
-    }
-    match (req_tag, ins_tag) {
-        (Some(req), Some(ins)) => req == ins,
-        (Some(req), None) => req == "latest",
-        (None, Some(ins)) => ins == "latest",
-        (None, None) => true,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 fn main() {}
 
 #[cfg(test)]
 mod tests {
     #[test]
