--- src/daemon.rs
+++ replace write_tasks_audit_log -> Result<()> with Ok(())
@@ -1995,34 +1995,10 @@
 
 fn write_tasks_audit_log(
     path: Option<&str>,
     ts: i64,
     task: &crate::tasks::ScheduledTask,
     status: &str,
     payload: serde_json::Value,
 ) -> Result<()> {
-    let Some(path) = path else {
-        return Ok(());
-    };
-    config_store::ensure_parent_dir(path)?;
-    let mut file = std::fs::OpenOptions::new()
-        .create(true)
-        .append(true)
-        .open(path)
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    let entry = serde_json::json!({
-        "timestamp": ts,
-        "task_id": task.id,
-        "user_id": task.user_id,
-        "name": task.name,
-        "prompt": task.prompt,
-        "run_at": task.run_at,
-        "interval_minutes": task.interval_minutes,
-        "status": status,
-        "payload": payload,
-    });
-    let line = serde_json::to_string(&entry)
-        .map_err(|e| ButterflyBotError::Serialization(e.to_string()))?;
-    use std::io::Write;
-    writeln!(file, "{line}").map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
