--- src/main.rs
+++ replace != with == in model_matches
@@ -281,17 +281,17 @@
         _ => (model.to_string(), None),
     }
 }
 
 #[cfg(not(test))]
 fn model_matches(required: &str, installed: &str) -> bool {
     let (req_base, req_tag) = split_model_name(required);
     let (ins_base, ins_tag) = split_model_name(installed);
-    if req_base != ins_base {
+    if req_base == /* ~ changed by cargo-mutants ~ */ ins_base {
         return false;
     }
     match (req_tag, ins_tag) {
         (Some(req), Some(ins)) => req == ins,
         (Some(req), None) => req == "latest",
         (None, Some(ins)) => ins == "latest",
         (None, None) => true,
     }
