--- src/daemon.rs
+++ replace || with && in run_security_audit_checks
@@ -710,17 +710,17 @@
             ));
 
             let has_inline_api_key = config
                 .openai
                 .as_ref()
                 .and_then(|openai| openai.api_key.as_ref())
                 .map(|key| !key.trim().is_empty())
                 .unwrap_or(false)
-                || config
+                && /* ~ changed by cargo-mutants ~ */ config
                     .memory
                     .as_ref()
                     .and_then(|memory| memory.openai.as_ref())
                     .and_then(|openai| openai.api_key.as_ref())
                     .map(|key| !key.trim().is_empty())
                     .unwrap_or(false);
 
             if has_inline_api_key {
