--- src/db.rs
+++ replace tune_sqlcipher_log_level_sync with ()
@@ -6,21 +6,17 @@
 use rand::rngs::SysRng;
 use rand::TryRng;
 
 use crate::error::{ButterflyBotError, Result};
 
 const DB_KEY_NAME: &str = "db_encryption_key";
 
 fn tune_sqlcipher_log_level_sync(conn: &mut SqliteConnection) {
-    if let Err(err) =
-        diesel::RunQueryDsl::execute(diesel::sql_query("PRAGMA cipher_log_level = ERROR"), conn)
-    {
-        tracing::debug!("Unable to set SQLCipher log level (sync): {}", err);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 async fn tune_sqlcipher_log_level_async(conn: &mut SyncConnectionWrapper<SqliteConnection>) {
     if let Err(err) = diesel_async::RunQueryDsl::execute(
         diesel::sql_query("PRAGMA cipher_log_level = ERROR"),
         conn,
     )
     .await
