--- src/db.rs
+++ replace log_sqlcipher_key_source_once with ()
@@ -25,20 +25,17 @@
     )
     .await
     {
         tracing::debug!("Unable to set SQLCipher log level (async): {}", err);
     }
 }
 
 fn log_sqlcipher_key_source_once(source: &str) {
-    static LOGGED: OnceLock<()> = OnceLock::new();
-    if LOGGED.set(()).is_ok() {
-        tracing::info!(db_key_source = source, "Resolved SQLCipher key source");
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn generated_db_key() -> Result<String> {
     let mut bytes = [0u8; 32];
     let mut rng = SysRng;
     rng.try_fill_bytes(&mut bytes)
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     Ok(URL_SAFE_NO_PAD.encode(bytes))
