--- src/main.rs
+++ replace main -> Result<()> with Ok(())
@@ -37,53 +37,17 @@
 
     #[arg(long, default_value_t = false, requires = "migrate_secrets")]
     migrate_secrets_dry_run: bool,
 }
 
 #[cfg(not(test))]
 #[tokio::main]
 async fn main() -> Result<()> {
-    let filter = EnvFilter::try_from_default_env()
-        .unwrap_or_else(|_| EnvFilter::new("info,butterfly_bot=info"));
-    tracing_subscriber::fmt().with_env_filter(filter).init();
-    force_dbusrs();
-
-    let cli = Cli::parse();
-
-    if cli.migrate_secrets {
-        let mode = if cli.migrate_secrets_dry_run {
-            butterfly_bot::security::migration::MigrationMode::DryRun
-        } else {
-            butterfly_bot::security::migration::MigrationMode::Apply
-        };
-
-        let report = butterfly_bot::security::migration::run_legacy_secret_migration(mode)?;
-        println!(
-            "Secret migration ({:?}): checked={} migrated={} skipped={} errors={}",
-            report.mode, report.checked, report.migrated, report.skipped, report.errors
-        );
-        for item in report.items {
-            println!("- {}: {} ({})", item.name, item.status, item.detail);
-        }
-
-        return Ok(());
-    }
-
-    let _token = vault::ensure_daemon_auth_token()?;
-
-    let config = ensure_default_config(&cli.db)?;
-    ensure_ollama_installed(&config)?;
-    ensure_ollama_models(&config)?;
-    ui::launch_ui_with_config(ui::UiLaunchConfig {
-        db_path: cli.db,
-        daemon_url: cli.daemon,
-        user_id: cli.user_id,
-    });
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(test))]
 #[cfg(target_os = "linux")]
 fn force_dbusrs() {}
 
 #[cfg(not(test))]
 #[cfg(not(target_os = "linux"))]
