--- src/main.rs
+++ replace ensure_default_config -> Result<Config> with Ok(Default::default())
@@ -86,24 +86,17 @@
 fn force_dbusrs() {}
 
 #[cfg(not(test))]
 #[cfg(not(target_os = "linux"))]
 fn force_dbusrs() {}
 
 #[cfg(not(test))]
 fn ensure_default_config(db_path: &str) -> Result<Config> {
-    match Config::from_store(db_path) {
-        Ok(config) => Ok(config),
-        Err(_) => {
-            let config = Config::convention_defaults(db_path);
-            config_store::save_config(db_path, &config)?;
-            Ok(config)
-        }
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(test))]
 fn ensure_ollama_installed(config: &Config) -> Result<()> {
     if !uses_local_ollama(config) {
         return Ok(());
     }
     install_ollama_if_missing()
