--- src/db.rs
+++ replace apply_sqlcipher_key_sync -> Result<()> with Ok(())
@@ -55,27 +55,17 @@
 
     let generated = generated_db_key()?;
     crate::vault::set_secret_required(DB_KEY_NAME, &generated)?;
     log_sqlcipher_key_source_once("generated_keychain");
     Ok(generated)
 }
 
 pub fn apply_sqlcipher_key_sync(conn: &mut SqliteConnection) -> Result<()> {
-    diesel::RunQueryDsl::execute(diesel::sql_query("PRAGMA busy_timeout = 5000"), conn)
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    let key = get_sqlcipher_key()?;
-    let escaped_key = key.replace('\'', "''");
-    diesel::RunQueryDsl::execute(
-        diesel::sql_query(format!("PRAGMA key = '{escaped_key}'")),
-        conn,
-    )
-    .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-    tune_sqlcipher_log_level_sync(conn);
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn apply_sqlcipher_key_async(
     conn: &mut SyncConnectionWrapper<SqliteConnection>,
 ) -> Result<()> {
     diesel_async::RunQueryDsl::execute(diesel::sql_query("PRAGMA busy_timeout = 5000"), conn)
         .await
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
