--- src/planning/mod.rs
+++ replace PlanStore::list_plans -> Result<Vec<PlanItem>> with Ok(vec![])
@@ -111,25 +111,17 @@
             .order(plans::id.desc())
             .first(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(map_row(row))
     }
 
     pub async fn list_plans(&self, user_id: &str, limit: usize) -> Result<Vec<PlanItem>> {
-        let mut conn = self.conn().await?;
-        let rows: Vec<PlanRow> = plans::table
-            .filter(plans::user_id.eq(user_id))
-            .order(plans::created_at.desc())
-            .limit(limit as i64)
-            .load(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(rows.into_iter().map(map_row).collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn get_plan(&self, id: i32) -> Result<PlanItem> {
         let mut conn = self.conn().await?;
         let row: PlanRow = plans::table
             .filter(plans::id.eq(id))
             .first(&mut conn)
             .await
