--- src/planning/mod.rs
+++ replace PlanStore::delete_plan -> Result<bool> with Ok(true)
@@ -184,22 +184,17 @@
             .filter(plans::id.eq(id))
             .first(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(map_row(row))
     }
 
     pub async fn delete_plan(&self, id: i32) -> Result<bool> {
-        let mut conn = self.conn().await?;
-        let count = diesel::delete(plans::table.filter(plans::id.eq(id)))
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(count > 0)
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn conn(&self) -> Result<SqlitePooledConn<'_>> {
         let mut conn = self
             .pool
             .get()
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
