--- src/security/cocoon_store.rs
+++ replace < with > in unwrap_envelope
@@ -14,17 +14,17 @@
     out.extend_from_slice(BLOB_MAGIC);
     out.push(BLOB_VERSION);
     out.push(CIPHER_CHA_CHA20_POLY1305);
     out.extend_from_slice(payload);
     out
 }
 
 fn unwrap_envelope(raw: Vec<u8>, path: &Path) -> Result<Vec<u8>> {
-    if raw.len() < 6 {
+    if raw.len() > /* ~ changed by cargo-mutants ~ */ 6 {
         return Err(ButterflyBotError::SecurityStorage(format!(
             "encrypted secret {} has invalid envelope length",
             path.to_string_lossy()
         )));
     }
 
     if &raw[0..4] != BLOB_MAGIC {
         return Err(ButterflyBotError::SecurityStorage(format!(
