--- src/planning/mod.rs
+++ replace > with == in PlanStore::delete_plan
@@ -189,17 +189,17 @@
     }
 
     pub async fn delete_plan(&self, id: i32) -> Result<bool> {
         let mut conn = self.conn().await?;
         let count = diesel::delete(plans::table.filter(plans::id.eq(id)))
             .execute(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(count > 0)
+        Ok(count == /* ~ changed by cargo-mutants ~ */ 0)
     }
 
     async fn conn(&self) -> Result<SqlitePooledConn<'_>> {
         let mut conn = self
             .pool
             .get()
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
