--- src/planning/mod.rs
+++ replace run_migrations -> Result<()> with Ok(())
@@ -226,28 +226,17 @@
     let path = Path::new(path);
     if let Some(parent) = path.parent() {
         std::fs::create_dir_all(parent).map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     }
     Ok(())
 }
 
 async fn run_migrations(database_url: &str) -> Result<()> {
-    let database_url = database_url.to_string();
-    tokio::task::spawn_blocking(move || {
-        let mut conn = SqliteConnection::establish(&database_url)
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        crate::db::apply_sqlcipher_key_sync(&mut conn)?;
-        conn.run_pending_migrations(MIGRATIONS)
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok::<_, ButterflyBotError>(())
-    })
-    .await
-    .map_err(|e| ButterflyBotError::Runtime(e.to_string()))??;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn ensure_plans_table(database_url: &str) -> Result<()> {
     let database_url = database_url.to_string();
     tokio::task::spawn_blocking(move || {
         let mut conn = SqliteConnection::establish(&database_url)
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         crate::db::apply_sqlcipher_key_sync(&mut conn)?;
