--- src/security/cocoon_store.rs
+++ replace load_secret -> Result<Option<String>> with Ok(Some("xyzzy".into()))
@@ -50,53 +50,17 @@
             cipher
         )));
     }
 
     Ok(raw[6..].to_vec())
 }
 
 pub fn load_secret(path: &Path, passphrase: &str) -> Result<Option<String>> {
-    if !path.exists() {
-        return Ok(None);
-    }
-
-    let mut file = File::open(path).map_err(|e| {
-        ButterflyBotError::SecurityStorage(format!(
-            "failed to open encrypted secret {}: {e}",
-            path.to_string_lossy()
-        ))
-    })?;
-
-    let cocoon = Cocoon::new(passphrase.as_bytes());
-    let decoded = cocoon.parse(&mut file).map_err(|e| {
-        ButterflyBotError::SecurityStorage(format!(
-            "failed to decrypt encrypted secret {}: {e:?}",
-            path.to_string_lossy()
-        ))
-    })?;
-
-    let payload = unwrap_envelope(decoded, path)?;
-
-    let value = String::from_utf8(payload).map_err(|e| {
-        ButterflyBotError::SecurityStorage(format!(
-            "invalid utf8 in encrypted secret {}: {e}",
-            path.to_string_lossy()
-        ))
-    })?;
-
-    let trimmed = value.trim();
-    if trimmed.is_empty() {
-        return Err(ButterflyBotError::SecurityStorage(format!(
-            "encrypted secret {} is empty",
-            path.to_string_lossy()
-        )));
-    }
-
-    Ok(Some(trimmed.to_string()))
+    Ok(Some("xyzzy".into())) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn persist_secret(path: &Path, passphrase: &str, value: &str) -> Result<()> {
     if let Some(parent) = path.parent() {
         std::fs::create_dir_all(parent).map_err(|e| {
             ButterflyBotError::SecurityStorage(format!(
                 "failed to create encrypted secret directory {}: {e}",
                 parent.to_string_lossy()
