--- src/security/cocoon_store.rs
+++ delete ! in load_secret
@@ -50,17 +50,17 @@
             cipher
         )));
     }
 
     Ok(raw[6..].to_vec())
 }
 
 pub fn load_secret(path: &Path, passphrase: &str) -> Result<Option<String>> {
-    if !path.exists() {
+    if  /* ~ changed by cargo-mutants ~ */path.exists() {
         return Ok(None);
     }
 
     let mut file = File::open(path).map_err(|e| {
         ButterflyBotError::SecurityStorage(format!(
             "failed to open encrypted secret {}: {e}",
             path.to_string_lossy()
         ))
