--- src/planning/mod.rs
+++ replace PlanStore::create_plan -> Result<PlanItem> with Ok(Default::default())
@@ -81,43 +81,17 @@
     pub async fn create_plan(
         &self,
         user_id: &str,
         title: &str,
         goal: &str,
         steps: Option<&Value>,
         status: Option<&str>,
     ) -> Result<PlanItem> {
-        let now = now_ts();
-        let steps_json = steps.map(|value| value.to_string());
-        let status = status.unwrap_or("draft");
-        let new = NewPlan {
-            user_id,
-            title,
-            goal,
-            steps_json: steps_json.as_deref(),
-            status,
-            created_at: now,
-            updated_at: now,
-        };
-
-        let mut conn = self.conn().await?;
-        diesel::insert_into(plans::table)
-            .values(&new)
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-
-        let row: PlanRow = plans::table
-            .filter(plans::user_id.eq(user_id))
-            .order(plans::id.desc())
-            .first(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(map_row(row))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn list_plans(&self, user_id: &str, limit: usize) -> Result<Vec<PlanItem>> {
         let mut conn = self.conn().await?;
         let rows: Vec<PlanRow> = plans::table
             .filter(plans::user_id.eq(user_id))
             .order(plans::created_at.desc())
             .limit(limit as i64)
