--- src/security/cocoon_store.rs
+++ replace persist_secret -> Result<()> with Ok(())
@@ -90,56 +90,17 @@
             path.to_string_lossy()
         )));
     }
 
     Ok(Some(trimmed.to_string()))
 }
 
 pub fn persist_secret(path: &Path, passphrase: &str, value: &str) -> Result<()> {
-    if let Some(parent) = path.parent() {
-        std::fs::create_dir_all(parent).map_err(|e| {
-            ButterflyBotError::SecurityStorage(format!(
-                "failed to create encrypted secret directory {}: {e}",
-                parent.to_string_lossy()
-            ))
-        })?;
-
-        #[cfg(unix)]
-        {
-            use std::os::unix::fs::PermissionsExt;
-            let _ = std::fs::set_permissions(parent, std::fs::Permissions::from_mode(0o700));
-        }
-    }
-
-    let mut file = File::create(path).map_err(|e| {
-        ButterflyBotError::SecurityStorage(format!(
-            "failed to create encrypted secret {}: {e}",
-            path.to_string_lossy()
-        ))
-    })?;
-
-    let mut cocoon = Cocoon::new(passphrase.as_bytes());
-    let payload = wrap_envelope(value.as_bytes());
-    cocoon
-        .dump(payload, &mut file)
-        .map_err(|e| {
-            ButterflyBotError::SecurityStorage(format!(
-                "failed to write encrypted secret {}: {e:?}",
-                path.to_string_lossy()
-            ))
-        })?;
-
-    #[cfg(unix)]
-    {
-        use std::os::unix::fs::PermissionsExt;
-        let _ = std::fs::set_permissions(path, std::fs::Permissions::from_mode(0o600));
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn cocoon_roundtrip_secret() {
