--- src/reminders/mod.rs
+++ replace ReminderStore::list_reminders -> Result<Vec<ReminderItem>> with Ok(vec![Default::default()])
@@ -125,41 +125,17 @@
     }
 
     pub async fn list_reminders(
         &self,
         user_id: &str,
         status: ReminderStatus,
         limit: usize,
     ) -> Result<Vec<ReminderItem>> {
-        let mut conn = self.conn().await?;
-        let mut query = reminders::table
-            .filter(reminders::user_id.eq(user_id))
-            .into_boxed();
-
-        match status {
-            ReminderStatus::Open => {
-                query = query.filter(reminders::completed_at.is_null());
-            }
-            ReminderStatus::Completed => {
-                query = query.filter(reminders::completed_at.is_not_null());
-            }
-            ReminderStatus::All => {}
-        }
-
-        if limit > 0 {
-            query = query.limit(limit as i64);
-        }
-
-        let rows: Vec<ReminderRow> = query
-            .order(reminders::due_at.asc())
-            .load(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(rows.into_iter().map(map_row).collect())
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn complete_reminder(&self, user_id: &str, id: i32) -> Result<bool> {
         let now = now_ts();
         let mut conn = self.conn().await?;
         let updated = diesel::update(
             reminders::table
                 .filter(reminders::user_id.eq(user_id))
