--- src/security/secret_policy.rs
+++ replace SecretResolutionPolicy::mode -> SecretResolutionMode with Default::default()
@@ -5,17 +5,17 @@
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct SecretResolutionPolicy {
     mode: SecretResolutionMode,
 }
 
 impl SecretResolutionPolicy {
     pub fn mode(self) -> SecretResolutionMode {
-        self.mode
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_strict(self) -> bool {
         matches!(self.mode, SecretResolutionMode::Strict)
     }
 }
 
 pub fn current_secret_resolution_policy() -> SecretResolutionPolicy {
