--- src/reminders/mod.rs
+++ replace > with == in ReminderStore::list_reminders
@@ -140,17 +140,17 @@
                 query = query.filter(reminders::completed_at.is_null());
             }
             ReminderStatus::Completed => {
                 query = query.filter(reminders::completed_at.is_not_null());
             }
             ReminderStatus::All => {}
         }
 
-        if limit > 0 {
+        if limit == /* ~ changed by cargo-mutants ~ */ 0 {
             query = query.limit(limit as i64);
         }
 
         let rows: Vec<ReminderRow> = query
             .order(reminders::due_at.asc())
             .load(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
