--- src/security/secret_policy.rs
+++ replace SecretResolutionPolicy::is_strict -> bool with false
@@ -9,17 +9,17 @@
 }
 
 impl SecretResolutionPolicy {
     pub fn mode(self) -> SecretResolutionMode {
         self.mode
     }
 
     pub fn is_strict(self) -> bool {
-        matches!(self.mode, SecretResolutionMode::Strict)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub fn current_secret_resolution_policy() -> SecretResolutionPolicy {
     SecretResolutionPolicy {
         mode: SecretResolutionMode::Strict,
     }
 }
