--- src/security/secret_policy.rs
+++ replace current_secret_resolution_policy -> SecretResolutionPolicy with Default::default()
@@ -14,19 +14,17 @@
     }
 
     pub fn is_strict(self) -> bool {
         matches!(self.mode, SecretResolutionMode::Strict)
     }
 }
 
 pub fn current_secret_resolution_policy() -> SecretResolutionPolicy {
-    SecretResolutionPolicy {
-        mode: SecretResolutionMode::Strict,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn always_strict_policy() {
