--- src/reminders/mod.rs
+++ replace ReminderStore::complete_reminder -> Result<bool> with Ok(true)
@@ -153,28 +153,17 @@
             .order(reminders::due_at.asc())
             .load(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(rows.into_iter().map(map_row).collect())
     }
 
     pub async fn complete_reminder(&self, user_id: &str, id: i32) -> Result<bool> {
-        let now = now_ts();
-        let mut conn = self.conn().await?;
-        let updated = diesel::update(
-            reminders::table
-                .filter(reminders::user_id.eq(user_id))
-                .filter(reminders::id.eq(id)),
-        )
-        .set(reminders::completed_at.eq(Some(now)))
-        .execute(&mut conn)
-        .await
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(updated > 0)
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn delete_reminder(&self, user_id: &str, id: i32) -> Result<bool> {
         let mut conn = self.conn().await?;
         let deleted = diesel::delete(
             reminders::table
                 .filter(reminders::user_id.eq(user_id))
                 .filter(reminders::id.eq(id)),
