--- src/reminders/mod.rs
+++ replace ReminderStore::delete_reminder -> Result<bool> with Ok(false)
@@ -168,26 +168,17 @@
         .set(reminders::completed_at.eq(Some(now)))
         .execute(&mut conn)
         .await
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(updated > 0)
     }
 
     pub async fn delete_reminder(&self, user_id: &str, id: i32) -> Result<bool> {
-        let mut conn = self.conn().await?;
-        let deleted = diesel::delete(
-            reminders::table
-                .filter(reminders::user_id.eq(user_id))
-                .filter(reminders::id.eq(id)),
-        )
-        .execute(&mut conn)
-        .await
-        .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(deleted > 0)
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn delete_all(&self, user_id: &str, include_completed: bool) -> Result<usize> {
         let mut conn = self.conn().await?;
         let deleted = if include_completed {
             diesel::delete(reminders::table.filter(reminders::user_id.eq(user_id)))
                 .execute(&mut conn)
                 .await
