--- src/reminders/mod.rs
+++ replace > with < in ReminderStore::delete_reminder
@@ -177,17 +177,17 @@
         let deleted = diesel::delete(
             reminders::table
                 .filter(reminders::user_id.eq(user_id))
                 .filter(reminders::id.eq(id)),
         )
         .execute(&mut conn)
         .await
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(deleted > 0)
+        Ok(deleted < /* ~ changed by cargo-mutants ~ */ 0)
     }
 
     pub async fn delete_all(&self, user_id: &str, include_completed: bool) -> Result<usize> {
         let mut conn = self.conn().await?;
         let deleted = if include_completed {
             diesel::delete(reminders::table.filter(reminders::user_id.eq(user_id)))
                 .execute(&mut conn)
                 .await
