--- src/security/tpm_provider.rs
+++ replace debug_available_override_lock -> &'static DebugRwLock<Option<bool>> with Box::leak(Box::new(DebugRwLock::from_iter([Some(false)])))
@@ -14,18 +14,17 @@
 use std::sync::{OnceLock as DebugOnceLock, RwLock as DebugRwLock};
 
 const SERVICE: &str = "butterfly-bot";
 const TPM_KEK_NAME: &str = "tpm_kek";
 const POLICY_VERSION: u8 = 1;
 
 #[cfg(all(debug_assertions, not(test)))]
 fn debug_available_override_lock() -> &'static DebugRwLock<Option<bool>> {
-    static OVERRIDE: DebugOnceLock<DebugRwLock<Option<bool>>> = DebugOnceLock::new();
-    OVERRIDE.get_or_init(|| DebugRwLock::new(None))
+    Box::leak(Box::new(DebugRwLock::from_iter([Some(false)]))) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(all(debug_assertions, not(test)))]
 fn debug_dek_override_lock() -> &'static DebugRwLock<Option<String>> {
     static OVERRIDE: DebugOnceLock<DebugRwLock<Option<String>>> = DebugOnceLock::new();
     OVERRIDE.get_or_init(|| DebugRwLock::new(None))
 }
 
