--- src/reminders/mod.rs
+++ replace ReminderStore::delete_all -> Result<usize> with Ok(0)
@@ -181,33 +181,17 @@
         )
         .execute(&mut conn)
         .await
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(deleted > 0)
     }
 
     pub async fn delete_all(&self, user_id: &str, include_completed: bool) -> Result<usize> {
-        let mut conn = self.conn().await?;
-        let deleted = if include_completed {
-            diesel::delete(reminders::table.filter(reminders::user_id.eq(user_id)))
-                .execute(&mut conn)
-                .await
-                .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?
-        } else {
-            diesel::delete(
-                reminders::table
-                    .filter(reminders::user_id.eq(user_id))
-                    .filter(reminders::completed_at.is_null()),
-            )
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?
-        };
-        Ok(deleted)
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn snooze_reminder(&self, user_id: &str, id: i32, due_at: i64) -> Result<bool> {
         let mut conn = self.conn().await?;
         let updated = diesel::update(
             reminders::table
                 .filter(reminders::user_id.eq(user_id))
                 .filter(reminders::id.eq(id)),
