--- src/reminders/mod.rs
+++ replace > with >= in ReminderStore::snooze_reminder
@@ -214,17 +214,17 @@
         )
         .set((
             reminders::due_at.eq(due_at),
             reminders::fired_at.eq::<Option<i64>>(None),
         ))
         .execute(&mut conn)
         .await
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(updated > 0)
+        Ok(updated >= /* ~ changed by cargo-mutants ~ */ 0)
     }
 
     pub async fn due_reminders(
         &self,
         user_id: &str,
         now: i64,
         limit: usize,
     ) -> Result<Vec<ReminderItem>> {
