--- src/security/tpm_provider.rs
+++ replace debug_dek_override_lock -> &'static DebugRwLock<Option<String>> with Box::leak(Box::new(DebugRwLock::from(None)))
@@ -20,18 +20,17 @@
 #[cfg(all(debug_assertions, not(test)))]
 fn debug_available_override_lock() -> &'static DebugRwLock<Option<bool>> {
     static OVERRIDE: DebugOnceLock<DebugRwLock<Option<bool>>> = DebugOnceLock::new();
     OVERRIDE.get_or_init(|| DebugRwLock::new(None))
 }
 
 #[cfg(all(debug_assertions, not(test)))]
 fn debug_dek_override_lock() -> &'static DebugRwLock<Option<String>> {
-    static OVERRIDE: DebugOnceLock<DebugRwLock<Option<String>>> = DebugOnceLock::new();
-    OVERRIDE.get_or_init(|| DebugRwLock::new(None))
+    Box::leak(Box::new(DebugRwLock::from(None))) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(all(debug_assertions, not(test)))]
 pub fn set_debug_tpm_available_override(value: Option<bool>) {
     let lock = debug_available_override_lock();
     match lock.write() {
         Ok(mut guard) => *guard = value,
         Err(poisoned) => {
