--- src/security/tpm_provider.rs
+++ replace set_debug_tpm_available_override with ()
@@ -26,24 +26,17 @@
 #[cfg(all(debug_assertions, not(test)))]
 fn debug_dek_override_lock() -> &'static DebugRwLock<Option<String>> {
     static OVERRIDE: DebugOnceLock<DebugRwLock<Option<String>>> = DebugOnceLock::new();
     OVERRIDE.get_or_init(|| DebugRwLock::new(None))
 }
 
 #[cfg(all(debug_assertions, not(test)))]
 pub fn set_debug_tpm_available_override(value: Option<bool>) {
-    let lock = debug_available_override_lock();
-    match lock.write() {
-        Ok(mut guard) => *guard = value,
-        Err(poisoned) => {
-            let mut guard = poisoned.into_inner();
-            *guard = value;
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(all(debug_assertions, not(test)))]
 pub fn set_debug_dek_passphrase_override(value: Option<String>) {
     let lock = debug_dek_override_lock();
     match lock.write() {
         Ok(mut guard) => *guard = value,
         Err(poisoned) => {
