--- src/security/tpm_provider.rs
+++ replace set_debug_dek_passphrase_override with ()
@@ -38,24 +38,17 @@
             let mut guard = poisoned.into_inner();
             *guard = value;
         }
     }
 }
 
 #[cfg(all(debug_assertions, not(test)))]
 pub fn set_debug_dek_passphrase_override(value: Option<String>) {
-    let lock = debug_dek_override_lock();
-    match lock.write() {
-        Ok(mut guard) => *guard = value,
-        Err(poisoned) => {
-            let mut guard = poisoned.into_inner();
-            *guard = value;
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(all(debug_assertions, not(test)))]
 fn debug_tpm_available_override() -> Option<bool> {
     let lock = debug_available_override_lock();
     match lock.read() {
         Ok(guard) => *guard,
         Err(poisoned) => *poisoned.into_inner(),
