--- src/reminders/mod.rs
+++ replace ReminderStore::conn -> Result<SqlitePooledConn<'_>> with Ok(Default::default())
@@ -283,23 +283,17 @@
             .order(reminders::due_at.asc())
             .load(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(rows.into_iter().map(map_row).collect())
     }
 
     async fn conn(&self) -> Result<SqlitePooledConn<'_>> {
-        let mut conn = self
-            .pool
-            .get()
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        crate::db::apply_sqlcipher_key_async(&mut conn).await?;
-        Ok(conn)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy)]
 pub enum ReminderStatus {
     Open,
     Completed,
     All,
