--- src/reminders/mod.rs
+++ replace <impl std::str::FromStr for ReminderStatus>::from_str -> std::result::Result<Self, Self::Err> with Ok(Default::default())
@@ -312,21 +312,17 @@
             .unwrap_or(ReminderStatus::Open)
     }
 }
 
 impl std::str::FromStr for ReminderStatus {
     type Err = ();
 
     fn from_str(value: &str) -> std::result::Result<Self, Self::Err> {
-        Ok(match value {
-            "completed" => ReminderStatus::Completed,
-            "all" => ReminderStatus::All,
-            _ => ReminderStatus::Open,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn map_row(row: ReminderRow) -> ReminderItem {
     ReminderItem {
         id: row.id,
         title: row.title,
         due_at: row.due_at,
