--- src/reminders/mod.rs
+++ delete match arm "completed" in <impl std::str::FromStr for ReminderStatus>::from_str
@@ -313,17 +313,17 @@
     }
 }
 
 impl std::str::FromStr for ReminderStatus {
     type Err = ();
 
     fn from_str(value: &str) -> std::result::Result<Self, Self::Err> {
         Ok(match value {
-            "completed" => ReminderStatus::Completed,
+             /* ~ changed by cargo-mutants ~ */
             "all" => ReminderStatus::All,
             _ => ReminderStatus::Open,
         })
     }
 }
 
 fn map_row(row: ReminderRow) -> ReminderItem {
     ReminderItem {
