--- src/reminders/mod.rs
+++ delete match arm "all" in <impl std::str::FromStr for ReminderStatus>::from_str
@@ -314,17 +314,17 @@
 }
 
 impl std::str::FromStr for ReminderStatus {
     type Err = ();
 
     fn from_str(value: &str) -> std::result::Result<Self, Self::Err> {
         Ok(match value {
             "completed" => ReminderStatus::Completed,
-            "all" => ReminderStatus::All,
+             /* ~ changed by cargo-mutants ~ */
             _ => ReminderStatus::Open,
         })
     }
 }
 
 fn map_row(row: ReminderRow) -> ReminderItem {
     ReminderItem {
         id: row.id,
