--- src/vault.rs
+++ replace get_secret -> Result<Option<String>> with Ok(None)
@@ -102,17 +102,17 @@
     set_secret_internal(name, value, false)
 }
 
 fn set_secret_internal(name: &str, value: &str, allow_backend_unavailable: bool) -> Result<()> {
     active_provider().set_secret(name, value, allow_backend_unavailable)
 }
 
 pub fn get_secret(name: &str) -> Result<Option<String>> {
-    active_provider().get_secret(name)
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn ensure_daemon_auth_token() -> Result<String> {
     if let Some(token) = get_secret("daemon_auth_token")? {
         let trimmed = token.trim().to_string();
         if !trimmed.is_empty() {
             return Ok(trimmed);
         }
