--- src/reminders/mod.rs
+++ replace resolve_reminder_db_path -> Option<String> with Some(String::new())
@@ -392,38 +392,17 @@
         Ok::<_, ButterflyBotError>(())
     })
     .await
     .map_err(|e| ButterflyBotError::Runtime(e.to_string()))??;
     Ok(())
 }
 
 pub fn resolve_reminder_db_path(config: &serde_json::Value) -> Option<String> {
-    let tool_path = config
-        .get("tools")
-        .and_then(|v| v.get("reminders"))
-        .and_then(|v| v.get("sqlite_path"))
-        .and_then(|v| v.as_str())
-        .map(|v| v.trim().to_string());
-    if let Some(path) = tool_path {
-        if !path.is_empty() {
-            return Some(path);
-        }
-    }
-    let memory_path = config
-        .get("memory")
-        .and_then(|v| v.get("sqlite_path"))
-        .and_then(|v| v.as_str())
-        .map(|v| v.trim().to_string());
-    if let Some(path) = memory_path {
-        if !path.is_empty() {
-            return Some(path);
-        }
-    }
-    None
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn default_reminder_db_path() -> String {
     crate::runtime_paths::default_db_path()
 }
 
 #[cfg(test)]
 mod tests {
