--- src/vault.rs
+++ delete ! in ensure_daemon_auth_token
@@ -108,17 +108,17 @@
 
 pub fn get_secret(name: &str) -> Result<Option<String>> {
     active_provider().get_secret(name)
 }
 
 pub fn ensure_daemon_auth_token() -> Result<String> {
     if let Some(token) = get_secret("daemon_auth_token")? {
         let trimmed = token.trim().to_string();
-        if !trimmed.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */trimmed.is_empty() {
             return Ok(trimmed);
         }
     }
 
     let mut bytes = [0u8; 32];
     let mut rng = SysRng;
     rng.try_fill_bytes(&mut bytes)
         .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
