--- src/reminders/mod.rs
+++ delete ! in resolve_reminder_db_path
@@ -399,17 +399,17 @@
 pub fn resolve_reminder_db_path(config: &serde_json::Value) -> Option<String> {
     let tool_path = config
         .get("tools")
         .and_then(|v| v.get("reminders"))
         .and_then(|v| v.get("sqlite_path"))
         .and_then(|v| v.as_str())
         .map(|v| v.trim().to_string());
     if let Some(path) = tool_path {
-        if !path.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */path.is_empty() {
             return Some(path);
         }
     }
     let memory_path = config
         .get("memory")
         .and_then(|v| v.get("sqlite_path"))
         .and_then(|v| v.as_str())
         .map(|v| v.trim().to_string());
