--- src/reminders/mod.rs
+++ delete ! in resolve_reminder_db_path
@@ -409,17 +409,17 @@
         }
     }
     let memory_path = config
         .get("memory")
         .and_then(|v| v.get("sqlite_path"))
         .and_then(|v| v.as_str())
         .map(|v| v.trim().to_string());
     if let Some(path) = memory_path {
-        if !path.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */path.is_empty() {
             return Some(path);
         }
     }
     None
 }
 
 pub fn default_reminder_db_path() -> String {
     crate::runtime_paths::default_db_path()
