--- src/vault.rs
+++ replace <impl SecretProvider for CocoonFileSecretProvider>::set_secret -> Result<()> with Ok(())
@@ -42,20 +42,17 @@
 
 impl SecretProvider for CocoonFileSecretProvider {
     fn set_secret(
         &self,
         name: &str,
         value: &str,
         _allow_backend_unavailable: bool,
     ) -> Result<()> {
-        let passphrase = self.passphrase()?;
-        crate::security::hardening::with_sensitive_string(passphrase, |sensitive_passphrase| {
-            cocoon_store::persist_secret(&self.secret_path(name), sensitive_passphrase, value)
-        })
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_secret(&self, name: &str) -> Result<Option<String>> {
         let passphrase = self.passphrase()?;
         crate::security::hardening::with_sensitive_string(passphrase, |sensitive_passphrase| {
             cocoon_store::load_secret(&self.secret_path(name), sensitive_passphrase)
         })
     }
