--- src/reminders/mod.rs
+++ replace default_reminder_db_path -> String with String::new()
@@ -417,17 +417,17 @@
         if !path.is_empty() {
             return Some(path);
         }
     }
     None
 }
 
 pub fn default_reminder_db_path() -> String {
-    crate::runtime_paths::default_db_path()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::{ReminderStatus, ReminderStore};
 
     #[tokio::test]
     async fn reminder_create_deduplicates_near_identical_open_reminders() {
