--- src/reminders/mod.rs
+++ replace ReminderStore::create_reminder -> Result<ReminderItem> with Ok(Default::default())
@@ -75,58 +75,17 @@
     }
 
     pub async fn create_reminder(
         &self,
         user_id: &str,
         title: &str,
         due_at: i64,
     ) -> Result<ReminderItem> {
-        let now = now_ts();
-        let mut conn = self.conn().await?;
-
-        let existing = reminders::table
-            .filter(reminders::user_id.eq(user_id))
-            .filter(reminders::title.eq(title))
-            .filter(reminders::completed_at.is_null())
-            .filter(reminders::fired_at.is_null())
-            .filter(reminders::due_at.ge(due_at - CREATE_DEDUP_DUE_AT_WINDOW_SECONDS))
-            .filter(reminders::due_at.le(due_at + CREATE_DEDUP_DUE_AT_WINDOW_SECONDS))
-            .order(reminders::id.desc())
-            .first::<ReminderRow>(&mut conn)
-            .await
-            .optional()
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-
-        if let Some(row) = existing {
-            return Ok(map_row(row));
-        }
-
-        let new = NewReminder {
-            user_id,
-            title,
-            due_at,
-            created_at: now,
-            completed_at: None,
-            fired_at: None,
-        };
-
-        diesel::insert_into(reminders::table)
-            .values(&new)
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-
-        let row: ReminderRow = reminders::table
-            .filter(reminders::user_id.eq(user_id))
-            .order(reminders::id.desc())
-            .first(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(map_row(row))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn list_reminders(
         &self,
         user_id: &str,
         status: ReminderStatus,
         limit: usize,
     ) -> Result<Vec<ReminderItem>> {
