--- src/reminders/mod.rs
+++ replace + with - in ReminderStore::create_reminder
@@ -84,17 +84,17 @@
         let mut conn = self.conn().await?;
 
         let existing = reminders::table
             .filter(reminders::user_id.eq(user_id))
             .filter(reminders::title.eq(title))
             .filter(reminders::completed_at.is_null())
             .filter(reminders::fired_at.is_null())
             .filter(reminders::due_at.ge(due_at - CREATE_DEDUP_DUE_AT_WINDOW_SECONDS))
-            .filter(reminders::due_at.le(due_at + CREATE_DEDUP_DUE_AT_WINDOW_SECONDS))
+            .filter(reminders::due_at.le(due_at - /* ~ changed by cargo-mutants ~ */ CREATE_DEDUP_DUE_AT_WINDOW_SECONDS))
             .order(reminders::id.desc())
             .first::<ReminderRow>(&mut conn)
             .await
             .optional()
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
 
         if let Some(row) = existing {
             return Ok(map_row(row));
