--- src/runtime_paths.rs
+++ replace platform_app_root -> PathBuf with Default::default()
@@ -23,25 +23,17 @@
         Err(poisoned) => {
             let mut guard = poisoned.into_inner();
             *guard = path;
         }
     }
 }
 
 fn platform_app_root() -> PathBuf {
-    if let Some(project_dirs) = ProjectDirs::from("", "", "butterfly-bot") {
-        return project_dirs.data_dir().to_path_buf();
-    }
-
-    if let Some(base_dirs) = BaseDirs::new() {
-        return base_dirs.data_local_dir().join("butterfly-bot");
-    }
-
-    std::env::temp_dir().join("butterfly-bot")
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn app_root() -> PathBuf {
     app_root_override().unwrap_or_else(platform_app_root)
 }
 
 pub fn default_db_path() -> String {
     app_root()
