--- src/runtime_paths.rs
+++ replace default_db_path -> String with String::new()
@@ -39,21 +39,17 @@
     std::env::temp_dir().join("butterfly-bot")
 }
 
 pub fn app_root() -> PathBuf {
     app_root_override().unwrap_or_else(platform_app_root)
 }
 
 pub fn default_db_path() -> String {
-    app_root()
-        .join("data")
-        .join("butterfly-bot.db")
-        .to_string_lossy()
-        .to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn default_wasm_dir_candidates() -> Vec<PathBuf> {
     let mut roots = Vec::new();
 
     if let Some(project_dirs) = ProjectDirs::from("", "", "butterfly-bot") {
         roots.push(project_dirs.data_dir().join("wasm"));
     }
