--- src/runtime_paths.rs
+++ replace default_wasm_dir_candidates -> Vec<PathBuf> with vec![]
@@ -47,29 +47,10 @@
     app_root()
         .join("data")
         .join("butterfly-bot.db")
         .to_string_lossy()
         .to_string()
 }
 
 pub fn default_wasm_dir_candidates() -> Vec<PathBuf> {
-    let mut roots = Vec::new();
-
-    if let Some(project_dirs) = ProjectDirs::from("", "", "butterfly-bot") {
-        roots.push(project_dirs.data_dir().join("wasm"));
-    }
-
-    if let Some(base_dirs) = BaseDirs::new() {
-        roots.push(base_dirs.data_local_dir().join("butterfly-bot").join("wasm"));
-    }
-
-    let app_root = app_root();
-    if !app_root.as_os_str().is_empty() {
-        roots.push(app_root.join("wasm"));
-    }
-
-    roots.push(std::env::temp_dir().join("butterfly-bot").join("wasm"));
-    roots.push(PathBuf::from(".").join("wasm"));
-
-    roots.dedup();
-    roots
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
