--- src/runtime_paths.rs
+++ replace app_root_override_lock -> &'static RwLock<Option<PathBuf>> with Box::leak(Box::new(RwLock::from_iter([Some(Default::default())])))
@@ -1,15 +1,14 @@
 use directories::{BaseDirs, ProjectDirs};
 use std::path::PathBuf;
 use std::sync::{OnceLock, RwLock};
 
 fn app_root_override_lock() -> &'static RwLock<Option<PathBuf>> {
-    static OVERRIDE: OnceLock<RwLock<Option<PathBuf>>> = OnceLock::new();
-    OVERRIDE.get_or_init(|| RwLock::new(None))
+    Box::leak(Box::new(RwLock::from_iter([Some(Default::default())]))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn app_root_override() -> Option<PathBuf> {
     let lock = app_root_override_lock();
     match lock.read() {
         Ok(guard) => guard.clone(),
         Err(poisoned) => poisoned.into_inner().clone(),
     }
