--- src/scheduler/mod.rs
+++ replace Scheduler::is_running -> bool with false
@@ -21,17 +21,17 @@
         }
     }
 
     pub fn register_job(&mut self, job: Arc<dyn ScheduledJob>) {
         self.jobs.push(job);
     }
 
     pub fn is_running(&self) -> bool {
-        self.stop.is_some()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn start(&mut self) {
         if self.stop.is_some() {
             return;
         }
         let (tx, rx) = watch::channel(false);
         self.stop = Some(tx);
