--- src/scheduler/mod.rs
+++ replace Scheduler::stop with ()
@@ -54,23 +54,17 @@
                     }
                 }
             });
             self.handles.push(handle);
         }
     }
 
     pub async fn stop(&mut self) {
-        if let Some(tx) = self.stop.take() {
-            let _ = tx.send(true);
-        }
-        let handles = std::mem::take(&mut self.handles);
-        for handle in handles {
-            let _ = handle.await;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for Scheduler {
     fn default() -> Self {
         Self::new()
     }
 }
