--- src/scheduler/mod.rs
+++ replace seconds -> Duration with Default::default()
@@ -71,10 +71,10 @@
 
 impl Default for Scheduler {
     fn default() -> Self {
         Self::new()
     }
 }
 
 pub fn seconds(n: u64) -> Duration {
-    Duration::from_secs(n)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
