--- src/tasks/mod.rs
+++ replace TaskStore::create_task -> Result<ScheduledTask> with Ok(Default::default())
@@ -106,46 +106,17 @@
     pub async fn create_task(
         &self,
         user_id: &str,
         name: &str,
         prompt: &str,
         run_at: i64,
         interval_minutes: Option<i64>,
     ) -> Result<ScheduledTask> {
-        let now = now_ts();
-        let interval_minutes = interval_minutes.filter(|v| *v > 0);
-        let next_run_at = run_at.max(now);
-        let new = NewTask {
-            user_id,
-            name,
-            prompt,
-            run_at,
-            interval_minutes,
-            enabled: true,
-            created_at: now,
-            updated_at: now,
-            last_run_at: None,
-            next_run_at,
-        };
-
-        let mut conn = self.conn().await?;
-        diesel::insert_into(scheduled_tasks::table)
-            .values(&new)
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-
-        let row: TaskRow = scheduled_tasks::table
-            .filter(scheduled_tasks::user_id.eq(user_id))
-            .order(scheduled_tasks::id.desc())
-            .first(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(map_row(row))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn list_tasks(
         &self,
         user_id: &str,
         status: TaskStatus,
         limit: usize,
     ) -> Result<Vec<ScheduledTask>> {
