--- src/tasks/mod.rs
+++ replace > with == in TaskStore::create_task
@@ -107,17 +107,17 @@
         &self,
         user_id: &str,
         name: &str,
         prompt: &str,
         run_at: i64,
         interval_minutes: Option<i64>,
     ) -> Result<ScheduledTask> {
         let now = now_ts();
-        let interval_minutes = interval_minutes.filter(|v| *v > 0);
+        let interval_minutes = interval_minutes.filter(|v| *v == /* ~ changed by cargo-mutants ~ */ 0);
         let next_run_at = run_at.max(now);
         let new = NewTask {
             user_id,
             name,
             prompt,
             run_at,
             interval_minutes,
             enabled: true,
