--- src/tasks/mod.rs
+++ replace TaskStore::set_enabled -> Result<ScheduledTask> with Ok(Default::default())
@@ -165,33 +165,17 @@
             .limit(limit as i64)
             .load(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(rows.into_iter().map(map_row).collect())
     }
 
     pub async fn set_enabled(&self, id: i32, enabled: bool) -> Result<ScheduledTask> {
-        let now = now_ts();
-        let mut conn = self.conn().await?;
-        diesel::update(scheduled_tasks::table.filter(scheduled_tasks::id.eq(id)))
-            .set((
-                scheduled_tasks::enabled.eq(enabled),
-                scheduled_tasks::updated_at.eq(now),
-            ))
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-
-        let row: TaskRow = scheduled_tasks::table
-            .filter(scheduled_tasks::id.eq(id))
-            .first(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(map_row(row))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn delete_task(&self, id: i32) -> Result<bool> {
         let mut conn = self.conn().await?;
         let count = diesel::delete(scheduled_tasks::table.filter(scheduled_tasks::id.eq(id)))
             .execute(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
