--- src/tasks/mod.rs
+++ replace TaskStore::mark_run -> Result<()> with Ok(())
@@ -207,28 +207,17 @@
             .limit(limit as i64)
             .load(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(rows.into_iter().map(map_row).collect())
     }
 
     pub async fn mark_run(&self, id: i32, last_run_at: i64, next_run_at: i64) -> Result<()> {
-        let now = now_ts();
-        let mut conn = self.conn().await?;
-        diesel::update(scheduled_tasks::table.filter(scheduled_tasks::id.eq(id)))
-            .set((
-                scheduled_tasks::last_run_at.eq(Some(last_run_at)),
-                scheduled_tasks::next_run_at.eq(next_run_at),
-                scheduled_tasks::updated_at.eq(now),
-            ))
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn complete_one_shot(&self, id: i32) -> Result<()> {
         let now = now_ts();
         let mut conn = self.conn().await?;
         diesel::update(scheduled_tasks::table.filter(scheduled_tasks::id.eq(id)))
             .set((
                 scheduled_tasks::enabled.eq(false),
