--- src/tasks/mod.rs
+++ replace TaskStore::complete_one_shot -> Result<()> with Ok(())
@@ -222,27 +222,17 @@
             ))
             .execute(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(())
     }
 
     pub async fn complete_one_shot(&self, id: i32) -> Result<()> {
-        let now = now_ts();
-        let mut conn = self.conn().await?;
-        diesel::update(scheduled_tasks::table.filter(scheduled_tasks::id.eq(id)))
-            .set((
-                scheduled_tasks::enabled.eq(false),
-                scheduled_tasks::updated_at.eq(now),
-            ))
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn conn(&self) -> Result<SqlitePooledConn<'_>> {
         let mut conn = self
             .pool
             .get()
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
