--- src/tasks/mod.rs
+++ replace resolve_task_db_path -> Option<String> with Some("xyzzy".into())
@@ -247,23 +247,17 @@
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         crate::db::apply_sqlcipher_key_async(&mut conn).await?;
         Ok(conn)
     }
 }
 
 pub fn resolve_task_db_path(config: &serde_json::Value) -> Option<String> {
-    config
-        .get("tools")
-        .and_then(|v| v.get("tasks"))
-        .and_then(|v| v.get("sqlite_path"))
-        .and_then(|v| v.as_str())
-        .map(|v| v.trim().to_string())
-        .filter(|path| !path.is_empty())
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn default_task_db_path() -> String {
     crate::runtime_paths::default_db_path()
 }
 
 fn ensure_parent_dir(path: &str) -> Result<()> {
     let path = Path::new(path);
