--- src/tasks/mod.rs
+++ replace default_task_db_path -> String with "xyzzy".into()
@@ -257,17 +257,17 @@
         .and_then(|v| v.get("tasks"))
         .and_then(|v| v.get("sqlite_path"))
         .and_then(|v| v.as_str())
         .map(|v| v.trim().to_string())
         .filter(|path| !path.is_empty())
 }
 
 pub fn default_task_db_path() -> String {
-    crate::runtime_paths::default_db_path()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn ensure_parent_dir(path: &str) -> Result<()> {
     let path = Path::new(path);
     if let Some(parent) = path.parent() {
         std::fs::create_dir_all(parent).map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     }
     Ok(())
