--- src/tasks/mod.rs
+++ replace map_row -> ScheduledTask with Default::default()
@@ -314,29 +314,17 @@
         Ok::<_, ButterflyBotError>(())
     })
     .await
     .map_err(|e| ButterflyBotError::Runtime(e.to_string()))??;
     Ok(())
 }
 
 fn map_row(row: TaskRow) -> ScheduledTask {
-    ScheduledTask {
-        id: row.id,
-        user_id: row.user_id,
-        name: row.name,
-        prompt: row.prompt,
-        run_at: row.run_at,
-        interval_minutes: row.interval_minutes,
-        enabled: row.enabled,
-        created_at: row.created_at,
-        updated_at: row.updated_at,
-        last_run_at: row.last_run_at,
-        next_run_at: row.next_run_at,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn now_ts() -> i64 {
     SystemTime::now()
         .duration_since(UNIX_EPOCH)
         .unwrap_or_default()
         .as_secs() as i64
 }
