--- src/tasks/mod.rs
+++ replace TaskStatus::from_option -> Self with Default::default()
@@ -71,21 +71,17 @@
 pub enum TaskStatus {
     Enabled,
     Disabled,
     All,
 }
 
 impl TaskStatus {
     pub fn from_option(value: Option<&str>) -> Self {
-        match value {
-            Some("enabled") => Self::Enabled,
-            Some("disabled") => Self::Disabled,
-            _ => Self::All,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub struct TaskStore {
     pool: SqlitePool,
 }
 
 impl TaskStore {
