--- src/tasks/mod.rs
+++ delete match arm Some("enabled") in TaskStatus::from_option
@@ -72,17 +72,17 @@
     Enabled,
     Disabled,
     All,
 }
 
 impl TaskStatus {
     pub fn from_option(value: Option<&str>) -> Self {
         match value {
-            Some("enabled") => Self::Enabled,
+             /* ~ changed by cargo-mutants ~ */
             Some("disabled") => Self::Disabled,
             _ => Self::All,
         }
     }
 }
 
 pub struct TaskStore {
     pool: SqlitePool,
