--- src/todo/mod.rs
+++ replace TodoStore::create_item -> Result<TodoItem> with Ok(Default::default())
@@ -96,49 +96,17 @@
     }
 
     pub async fn create_item(
         &self,
         user_id: &str,
         title: &str,
         notes: Option<&str>,
     ) -> Result<TodoItem> {
-        let now = now_ts();
-        let mut conn = self.conn().await?;
-        let max_pos: Option<i32> = todo_items::table
-            .filter(todo_items::user_id.eq(user_id))
-            .select(max(todo_items::position))
-            .first::<Option<i32>>(&mut conn)
-            .await
-            .unwrap_or(None);
-        let position = max_pos.unwrap_or(0) + 1;
-
-        let new = NewTodo {
-            user_id,
-            title,
-            notes,
-            position,
-            created_at: now,
-            updated_at: now,
-            completed_at: None,
-        };
-
-        diesel::insert_into(todo_items::table)
-            .values(&new)
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-
-        let row: TodoRow = todo_items::table
-            .filter(todo_items::user_id.eq(user_id))
-            .order(todo_items::id.desc())
-            .first(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(map_row(row))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn list_items(
         &self,
         user_id: &str,
         status: TodoStatus,
         limit: usize,
     ) -> Result<Vec<TodoItem>> {
