--- src/todo/mod.rs
+++ replace TodoStore::list_items -> Result<Vec<TodoItem>> with Ok(vec![])
@@ -137,38 +137,17 @@
     }
 
     pub async fn list_items(
         &self,
         user_id: &str,
         status: TodoStatus,
         limit: usize,
     ) -> Result<Vec<TodoItem>> {
-        let mut conn = self.conn().await?;
-        let mut query = todo_items::table
-            .filter(todo_items::user_id.eq(user_id))
-            .into_boxed();
-
-        match status {
-            TodoStatus::Open => {
-                query = query.filter(todo_items::completed_at.is_null());
-            }
-            TodoStatus::Completed => {
-                query = query.filter(todo_items::completed_at.is_not_null());
-            }
-            TodoStatus::All => {}
-        }
-
-        let rows: Vec<TodoRow> = query
-            .order(todo_items::position.asc())
-            .limit(limit as i64)
-            .load(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(rows.into_iter().map(map_row).collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn set_completed(&self, id: i32, completed: bool) -> Result<TodoItem> {
         let now = now_ts();
         let completed_at = if completed { Some(now) } else { None };
         let mut conn = self.conn().await?;
         diesel::update(todo_items::table.filter(todo_items::id.eq(id)))
             .set((
