--- src/todo/mod.rs
+++ replace TodoStore::delete_item -> Result<bool> with Ok(false)
@@ -183,22 +183,17 @@
             .filter(todo_items::id.eq(id))
             .first(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(map_row(row))
     }
 
     pub async fn delete_item(&self, id: i32) -> Result<bool> {
-        let mut conn = self.conn().await?;
-        let count = diesel::delete(todo_items::table.filter(todo_items::id.eq(id)))
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(count > 0)
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn reorder(&self, user_id: &str, ordered_ids: &[i32]) -> Result<()> {
         let now = now_ts();
         let mut conn = self.conn().await?;
         for (idx, id) in ordered_ids.iter().enumerate() {
             diesel::update(
                 todo_items::table
