--- src/todo/mod.rs
+++ replace > with >= in TodoStore::delete_item
@@ -188,17 +188,17 @@
     }
 
     pub async fn delete_item(&self, id: i32) -> Result<bool> {
         let mut conn = self.conn().await?;
         let count = diesel::delete(todo_items::table.filter(todo_items::id.eq(id)))
             .execute(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        Ok(count > 0)
+        Ok(count >= /* ~ changed by cargo-mutants ~ */ 0)
     }
 
     pub async fn reorder(&self, user_id: &str, ordered_ids: &[i32]) -> Result<()> {
         let now = now_ts();
         let mut conn = self.conn().await?;
         for (idx, id) in ordered_ids.iter().enumerate() {
             diesel::update(
                 todo_items::table
