--- src/todo/mod.rs
+++ replace TodoStore::reorder -> Result<()> with Ok(())
@@ -192,33 +192,17 @@
         let count = diesel::delete(todo_items::table.filter(todo_items::id.eq(id)))
             .execute(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         Ok(count > 0)
     }
 
     pub async fn reorder(&self, user_id: &str, ordered_ids: &[i32]) -> Result<()> {
-        let now = now_ts();
-        let mut conn = self.conn().await?;
-        for (idx, id) in ordered_ids.iter().enumerate() {
-            diesel::update(
-                todo_items::table
-                    .filter(todo_items::user_id.eq(user_id))
-                    .filter(todo_items::id.eq(*id)),
-            )
-            .set((
-                todo_items::position.eq((idx + 1) as i32),
-                todo_items::updated_at.eq(now),
-            ))
-            .execute(&mut conn)
-            .await
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn conn(&self) -> Result<SqlitePooledConn<'_>> {
         let mut conn = self
             .pool
             .get()
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
