--- src/todo/mod.rs
+++ replace + with * in TodoStore::reorder
@@ -201,17 +201,17 @@
         let mut conn = self.conn().await?;
         for (idx, id) in ordered_ids.iter().enumerate() {
             diesel::update(
                 todo_items::table
                     .filter(todo_items::user_id.eq(user_id))
                     .filter(todo_items::id.eq(*id)),
             )
             .set((
-                todo_items::position.eq((idx + 1) as i32),
+                todo_items::position.eq((idx * /* ~ changed by cargo-mutants ~ */ 1) as i32),
                 todo_items::updated_at.eq(now),
             ))
             .execute(&mut conn)
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         }
         Ok(())
     }
