--- src/todo/mod.rs
+++ replace resolve_todo_db_path -> Option<String> with Some(String::new())
@@ -223,23 +223,17 @@
             .await
             .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
         crate::db::apply_sqlcipher_key_async(&mut conn).await?;
         Ok(conn)
     }
 }
 
 pub fn resolve_todo_db_path(config: &serde_json::Value) -> Option<String> {
-    config
-        .get("tools")
-        .and_then(|v| v.get("todo"))
-        .and_then(|v| v.get("sqlite_path"))
-        .and_then(|v| v.as_str())
-        .map(|v| v.trim().to_string())
-        .filter(|path| !path.is_empty())
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn default_todo_db_path() -> String {
     crate::runtime_paths::default_db_path()
 }
 
 fn ensure_parent_dir(path: &str) -> Result<()> {
     let path = Path::new(path);
