--- src/todo/mod.rs
+++ replace ensure_todo_table -> Result<()> with Ok(())
@@ -260,43 +260,17 @@
         Ok::<_, ButterflyBotError>(())
     })
     .await
     .map_err(|e| ButterflyBotError::Runtime(e.to_string()))??;
     Ok(())
 }
 
 async fn ensure_todo_table(database_url: &str) -> Result<()> {
-    let database_url = database_url.to_string();
-    tokio::task::spawn_blocking(move || {
-        let mut conn = SqliteConnection::establish(&database_url)
-            .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-        crate::db::apply_sqlcipher_key_sync(&mut conn)?;
-
-        let check = diesel::connection::SimpleConnection::batch_execute(
-            &mut conn,
-            "SELECT 1 FROM todo_items LIMIT 1",
-        );
-        if let Err(err) = check {
-            let message = err.to_string();
-            if message.contains("no such table") {
-                conn.run_pending_migrations(MIGRATIONS)
-                    .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-                diesel::connection::SimpleConnection::batch_execute(&mut conn, TODO_UP_SQL)
-                    .map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
-            } else {
-                return Err(ButterflyBotError::Runtime(message));
-            }
-        }
-
-        Ok::<_, ButterflyBotError>(())
-    })
-    .await
-    .map_err(|e| ButterflyBotError::Runtime(e.to_string()))??;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_row(row: TodoRow) -> TodoItem {
     TodoItem {
         id: row.id,
         user_id: row.user_id,
         title: row.title,
         notes: row.notes,
