--- src/todo/mod.rs
+++ replace map_row -> TodoItem with Default::default()
@@ -290,26 +290,17 @@
         Ok::<_, ButterflyBotError>(())
     })
     .await
     .map_err(|e| ButterflyBotError::Runtime(e.to_string()))??;
     Ok(())
 }
 
 fn map_row(row: TodoRow) -> TodoItem {
-    TodoItem {
-        id: row.id,
-        user_id: row.user_id,
-        title: row.title,
-        notes: row.notes,
-        position: row.position,
-        created_at: row.created_at,
-        updated_at: row.updated_at,
-        completed_at: row.completed_at,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn now_ts() -> i64 {
     SystemTime::now()
         .duration_since(UNIX_EPOCH)
         .unwrap_or_default()
         .as_secs() as i64
 }
