--- src/todo/mod.rs
+++ replace now_ts -> i64 with 0
@@ -303,13 +303,10 @@
         position: row.position,
         created_at: row.created_at,
         updated_at: row.updated_at,
         completed_at: row.completed_at,
     }
 }
 
 fn now_ts() -> i64 {
-    SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .unwrap_or_default()
-        .as_secs() as i64
+    0 /* ~ changed by cargo-mutants ~ */
 }
