--- src/todo/mod.rs
+++ delete match arm Some("open") in TodoStatus::from_option
@@ -65,17 +65,17 @@
     Completed,
     All,
 }
 
 impl TodoStatus {
     pub fn from_option(value: Option<&str>) -> Self {
         match value {
             Some("completed") => Self::Completed,
-            Some("open") => Self::Open,
+             /* ~ changed by cargo-mutants ~ */
             _ => Self::All,
         }
     }
 }
 
 pub struct TodoStore {
     pool: SqlitePool,
 }
