--- src/ui.rs
+++ delete ! in app_view
@@ -996,17 +996,17 @@
                                 if resp.status().is_success() {
                                     daemon_ready = true;
                                     break;
                                 }
                             }
                             boot_status.set(format!("Waiting for daemon... ({}/10)", i + 1));
                         }
 
-                        if !daemon_ready {
+                        if  /* ~ changed by cargo-mutants ~ */daemon_ready {
                             daemon_running.set(false);
                             boot_status.set(
                                 "Daemon started but not responding. Continuing without preload."
                                     .to_string(),
                             );
                             boot_ready.set(true);
                         } else {
                             daemon_running.set(true);
