--- src/ui.rs
+++ replace match guard resp.status().is_success() with false in app_view
@@ -1016,17 +1016,17 @@
                                 .post(&url)
                                 .json(&PreloadBootRequest { user_id: user_id() });
                             let token_value = token();
                             if !token_value.trim().is_empty() {
                                 request = request
                                     .header("authorization", format!("Bearer {token_value}"));
                             }
                             match request.send().await {
-                                Ok(resp) if resp.status().is_success() => {
+                                Ok(resp) if false /* ~ changed by cargo-mutants ~ */ => {
                                     boot_status
                                         .set("Boot preload started in background…".to_string());
                                 }
                                 Ok(resp) => {
                                     let status = resp.status();
                                     boot_status.set(format!("Boot preload failed: HTTP {status}"));
                                 }
                                 Err(err) => {
