--- src/ui.rs
+++ replace && with || in app_view
@@ -1161,17 +1161,17 @@
         let messages = messages.clone();
         let last_bot_scroll_id = last_bot_scroll_id.clone();
 
         use_effect(move || {
             let latest_bot_id = messages
                 .read()
                 .iter()
                 .rev()
-                .find(|msg| msg.role == MessageRole::Bot && !msg.text.is_empty())
+                .find(|msg| msg.role == MessageRole::Bot || /* ~ changed by cargo-mutants ~ */ !msg.text.is_empty())
                 .map(|msg| msg.id)
                 .unwrap_or(0);
 
             if latest_bot_id == 0 || latest_bot_id == *last_bot_scroll_id.read() {
                 return;
             }
 
             let mut last_bot_scroll_id = last_bot_scroll_id.clone();
