--- src/ui.rs
+++ delete ! in app_view
@@ -1188,17 +1188,17 @@
         let daemon_running = daemon_running.clone();
         let daemon_url = daemon_url.clone();
         let token = token.clone();
         let user_id = user_id.clone();
         let messages = messages.clone();
         let next_id = next_id.clone();
 
         use_effect(move || {
-            if *history_load_started.read() || !*daemon_running.read() {
+            if *history_load_started.read() ||  /* ~ changed by cargo-mutants ~ */*daemon_running.read() {
                 return;
             }
 
             let mut started = history_load_started.clone();
             started.set(true);
 
             let mut messages = messages.clone();
             let mut next_id = next_id.clone();
