--- src/ui.rs
+++ replace || with && in app_view
@@ -1214,17 +1214,17 @@
                     return;
                 }
 
                 let parsed = history
                     .into_iter()
                     .filter_map(|line| parse_history_entry(&line))
                     .collect::<Vec<_>>();
 
-                if parsed.is_empty() || !messages.read().is_empty() {
+                if parsed.is_empty() && /* ~ changed by cargo-mutants ~ */ !messages.read().is_empty() {
                     return;
                 }
 
                 let mut list = messages.write();
                 if !list.is_empty() {
                     return;
                 }
 
