--- src/ui.rs
+++ delete ! in app_view
@@ -1294,17 +1294,17 @@
                         Err(_) => {
                             if cfg!(debug_assertions) {
                                 eprintln!("Reminder stream request failed (daemon unreachable?)");
                             }
                             sleep(Duration::from_secs(2)).await;
                             continue;
                         }
                     };
-                    if !response.status().is_success() {
+                    if  /* ~ changed by cargo-mutants ~ */response.status().is_success() {
                         if cfg!(debug_assertions) {
                             eprintln!("Reminder stream error: HTTP {}", response.status());
                         }
                         sleep(Duration::from_secs(2)).await;
                         continue;
                     }
 
                     let mut stream = response.bytes_stream();
