--- src/ui.rs
+++ replace + with - in app_view
@@ -1312,17 +1312,17 @@
                     while let Some(chunk) = stream.next().await {
                         let Ok(chunk) = chunk else {
                             break;
                         };
                         if let Ok(text) = std::str::from_utf8(&chunk) {
                             buffer.push_str(text);
                             while let Some(idx) = buffer.find('\n') {
                                 let mut line = buffer[..idx].to_string();
-                                buffer = buffer[idx + 1..].to_string();
+                                buffer = buffer[idx - /* ~ changed by cargo-mutants ~ */ 1..].to_string();
                                 if line.starts_with("data:") {
                                     line = line.trim_start_matches("data:").trim().to_string();
                                     if let Ok(value) = serde_json::from_str::<Value>(&line) {
                                         let title = value
                                             .get("title")
                                             .and_then(|v| v.as_str())
                                             .unwrap_or("Reminder");
                                         let id = next_id();
