--- src/ui.rs
+++ delete match arm UiTab::Activity in app_view
@@ -1356,17 +1356,17 @@
 
     {
         let active_tab = active_tab.clone();
         use_effect(move || {
             let tab = *active_tab.read();
             spawn(async move {
                 match tab {
                     UiTab::Chat => scroll_chat_after_render().await,
-                    UiTab::Activity => scroll_activity_after_render().await,
+                     /* ~ changed by cargo-mutants ~ */
                     _ => {}
                 }
             });
         });
     }
 
     {
         let ui_events_listener_started = ui_events_listener_started.clone();
