--- src/ui.rs
+++ delete ! in app_view
@@ -1408,17 +1408,17 @@
                     ui_events_listening.set(true);
                     let url = format!(
                         "{}/ui_events?user_id={}",
                         daemon_url().trim_end_matches('/'),
                         user_id()
                     );
                     let mut request = client.get(&url);
                     let token_value = token();
-                    if !token_value.trim().is_empty() {
+                    if  /* ~ changed by cargo-mutants ~ */token_value.trim().is_empty() {
                         request = request.header("authorization", format!("Bearer {token_value}"));
                     }
 
                     let response = match request.send().await {
                         Ok(resp) => resp,
                         Err(_) => {
                             sleep(Duration::from_secs(2)).await;
                             continue;
