--- src/ui.rs
+++ replace || with && in app_view
@@ -1461,17 +1461,17 @@
                                             .unwrap_or_default();
 
                                         // Always update boot readiness for boot/prompt/heartbeat events
                                         if (event_type == "boot" || tool == "prompt")
                                             && status == "ok"
                                         {
                                             boot_prompt_ready.set(true);
                                         }
-                                        if (event_type == "boot" || tool == "heartbeat")
+                                        if (event_type == "boot" && /* ~ changed by cargo-mutants ~ */ tool == "heartbeat")
                                             && status == "ok"
                                         {
                                             boot_heartbeat_ready.set(true);
                                         }
                                         if *boot_prompt_ready.read() && *boot_heartbeat_ready.read()
                                         {
                                             boot_ready.set(true);
                                             boot_status.set("Prompt + heartbeat ready".to_string());
