--- src/ui.rs
+++ replace == with != in app_view
@@ -1475,17 +1475,17 @@
                                         {
                                             boot_ready.set(true);
                                             boot_status.set("Prompt + heartbeat ready".to_string());
                                         }
 
                                         let show_success = false;
                                         if !show_success && (status == "success" || status == "ok")
                                         {
-                                            if event_type == "tool" {
+                                            if event_type != /* ~ changed by cargo-mutants ~ */ "tool" {
                                                 if event_user == "system" {
                                                     continue;
                                                 }
                                                 if let Some(payload) = value.get("payload") {
                                                     if payload.get("error").is_none()
                                                         && is_empty_list_result(payload)
                                                     {
                                                         continue;
