--- src/ui.rs
+++ replace && with || in app_view
@@ -1481,17 +1481,17 @@
                                         if !show_success && (status == "success" || status == "ok")
                                         {
                                             if event_type == "tool" {
                                                 if event_user == "system" {
                                                     continue;
                                                 }
                                                 if let Some(payload) = value.get("payload") {
                                                     if payload.get("error").is_none()
-                                                        && is_empty_list_result(payload)
+                                                        || /* ~ changed by cargo-mutants ~ */ is_empty_list_result(payload)
                                                     {
                                                         continue;
                                                     }
                                                 }
                                             } else if event_type != "boot"
                                                 && event_type != "autonomy"
                                             {
                                                 if let Some(payload) = value.get("payload") {
