--- src/ui.rs
+++ replace != with == in app_view
@@ -1486,17 +1486,17 @@
                                                 }
                                                 if let Some(payload) = value.get("payload") {
                                                     if payload.get("error").is_none()
                                                         && is_empty_list_result(payload)
                                                     {
                                                         continue;
                                                     }
                                                 }
-                                            } else if event_type != "boot"
+                                            } else if event_type == /* ~ changed by cargo-mutants ~ */ "boot"
                                                 && event_type != "autonomy"
                                             {
                                                 if let Some(payload) = value.get("payload") {
                                                     if payload.get("error").is_none() {
                                                         continue;
                                                     }
                                                 } else {
                                                     continue;
