--- src/ui.rs
+++ delete ! in app_view
@@ -1648,17 +1648,17 @@
                     Err(err) => {
                         settings_error.set(format!("Failed to load config: {err}"));
                         tools_loaded.set(true);
                         return;
                     }
                 };
 
                 match crate::vault::get_secret("app_config_json") {
-                    Ok(Some(secret)) if !secret.trim().is_empty() => {
+                    Ok(Some(secret)) if  /* ~ changed by cargo-mutants ~ */secret.trim().is_empty() => {
                         config_json_text.set(secret);
                         settings_status.set("Loaded config from keyring.".to_string());
                     }
                     Ok(_) => {
                         if let Ok(pretty) = serde_json::to_string_pretty(&config) {
                             config_json_text.set(pretty);
                         }
                     }
