--- src/ui.rs
+++ replace && with || in app_view
@@ -1744,17 +1744,17 @@
                                     })
                                     .unwrap_or_default();
                                 let mut header_entries = headers.iter().collect::<Vec<_>>();
                                 header_entries.sort_by(|(left, _), (right, _)| left.cmp(right));
                                 let (header_key, header_value) = header_entries
                                     .first()
                                     .map(|(key, value)| ((*key).clone(), (*value).clone()))
                                     .unwrap_or_else(|| (String::new(), String::new()));
-                                if name.is_empty() && url.is_empty() {
+                                if name.is_empty() || /* ~ changed by cargo-mutants ~ */ url.is_empty() {
                                     None
                                 } else {
                                     let primary_header_key = header_key.clone();
                                     Some(UiMcpServer {
                                         name,
                                         url,
                                         header_key,
                                         header_value,
