--- src/ui.rs
+++ replace run_chat_history_request -> Result<Vec<String>, String> with Ok(vec!["xyzzy".into()])
@@ -168,51 +168,17 @@
 }
 
 async fn run_chat_history_request(
     daemon_url: String,
     token: String,
     user_id: String,
     limit: usize,
 ) -> Result<Vec<String>, String> {
-    let client = reqwest::Client::new();
-    let url = format!(
-        "{}/chat_history?user_id={}&limit={}",
-        daemon_url.trim_end_matches('/'),
-        user_id,
-        limit
-    );
-    let mut request = client.get(url);
-    if !token.trim().is_empty() {
-        request = request.header("authorization", format!("Bearer {token}"));
-    }
-    let response = request.send().await.map_err(|err| err.to_string())?;
-    if !response.status().is_success() {
-        let status = response.status();
-        let text = response
-            .text()
-            .await
-            .unwrap_or_else(|_| "Unable to read response body".to_string());
-        return Err(format!("HTTP {status}: {text}"));
-    }
-
-    let value = response
-        .json::<Value>()
-        .await
-        .map_err(|err| err.to_string())?;
-    let history = value
-        .get("history")
-        .and_then(|v| v.as_array())
-        .map(|arr| {
-            arr.iter()
-                .filter_map(|item| item.as_str().map(|s| s.to_string()))
-                .collect::<Vec<_>>()
-        })
-        .unwrap_or_default();
-    Ok(history)
+    Ok(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn run_clear_user_history_request(
     daemon_url: String,
     token: String,
     user_id: String,
 ) -> Result<(), String> {
     let client = reqwest::Client::new();
