--- src/ui.rs
+++ delete ! in app_view
@@ -1890,17 +1890,17 @@
 
                             if parsed_servers.is_empty() {
                                 let base_url = http_call_cfg
                                     .get("base_url")
                                     .and_then(|v| v.as_str())
                                     .unwrap_or_default()
                                     .trim()
                                     .to_string();
-                                if !base_url.is_empty() {
+                                if  /* ~ changed by cargo-mutants ~ */base_url.is_empty() {
                                     let primary_header_key = header_key.clone();
                                     parsed_servers.push(UiHttpCallServer {
                                         name: "default".to_string(),
                                         url: base_url,
                                         header_key,
                                         header_value,
                                         headers: shared_headers,
                                         primary_header_key,
