--- src/ui.rs
+++ delete match arm "openai" | "grok" | "perplexity" in app_view
@@ -1911,17 +1911,17 @@
 
                         http_call_servers_form.set(parsed_servers);
                     }
 
                     if let Some(search_cfg) = tools_value.get("search_internet") {
                         if let Some(provider) = search_cfg.get("provider").and_then(|v| v.as_str())
                         {
                             let normalized = match provider {
-                                "openai" | "grok" | "perplexity" => provider,
+                                 /* ~ changed by cargo-mutants ~ */
                                 _ => "openai",
                             };
                             search_provider.set(normalized.to_string());
                         }
                         if let Some(model) = search_cfg.get("model").and_then(|v| v.as_str()) {
                             search_model.set(model.to_string());
                         }
                         if let Some(citations) =
