--- src/ui.rs
+++ delete ! in app_view
@@ -2010,17 +2010,17 @@
                     Err(err) => {
                         settings_error.set(format!("Vault error: {err}"));
                         tools_loaded.set(true);
                         return;
                     }
                 }
 
                 match crate::vault::get_secret("zapier_token") {
-                    Ok(Some(secret)) if !secret.trim().is_empty() => {
+                    Ok(Some(secret)) if  /* ~ changed by cargo-mutants ~ */secret.trim().is_empty() => {
                         zapier_token_input.set(secret);
                     }
                     Ok(_) => zapier_token_input.set(String::new()),
                     Err(err) => {
                         settings_error.set(format!("Vault error: {err}"));
                         tools_loaded.set(true);
                         return;
                     }
