--- src/ui.rs
+++ delete ! in app_view
@@ -2022,17 +2022,17 @@
                     Err(err) => {
                         settings_error.set(format!("Vault error: {err}"));
                         tools_loaded.set(true);
                         return;
                     }
                 }
 
                 match crate::vault::get_secret("coding_openai_api_key") {
-                    Ok(Some(secret)) if !secret.trim().is_empty() => {
+                    Ok(Some(secret)) if  /* ~ changed by cargo-mutants ~ */secret.trim().is_empty() => {
                         coding_api_key_input.set(secret);
                     }
                     Ok(_) => coding_api_key_input.set(String::new()),
                     Err(err) => {
                         settings_error.set(format!("Vault error: {err}"));
                         tools_loaded.set(true);
                         return;
                     }
