--- src/ui.rs
+++ replace run_clear_user_history_request -> Result<(), String> with Ok(())
@@ -210,36 +210,17 @@
     Ok(history)
 }
 
 async fn run_clear_user_history_request(
     daemon_url: String,
     token: String,
     user_id: String,
 ) -> Result<(), String> {
-    let client = reqwest::Client::new();
-    let url = format!("{}/clear_user_history", daemon_url.trim_end_matches('/'));
-    let mut request = client.post(url);
-    if !token.trim().is_empty() {
-        request = request.header("authorization", format!("Bearer {token}"));
-    }
-    let response = request
-        .json(&serde_json::json!({"user_id": user_id}))
-        .send()
-        .await
-        .map_err(|err| err.to_string())?;
-    if !response.status().is_success() {
-        let status = response.status();
-        let text = response
-            .text()
-            .await
-            .unwrap_or_else(|_| "Unable to read response body".to_string());
-        return Err(format!("HTTP {status}: {text}"));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone)]
 struct ChatMessage {
     id: u64,
     role: MessageRole,
     text: String,
     html: String,
