--- src/ui.rs
+++ delete ! in run_clear_user_history_request
@@ -221,17 +221,17 @@
     if !token.trim().is_empty() {
         request = request.header("authorization", format!("Bearer {token}"));
     }
     let response = request
         .json(&serde_json::json!({"user_id": user_id}))
         .send()
         .await
         .map_err(|err| err.to_string())?;
-    if !response.status().is_success() {
+    if  /* ~ changed by cargo-mutants ~ */response.status().is_success() {
         let status = response.status();
         let text = response
             .text()
             .await
             .unwrap_or_else(|_| "Unable to read response body".to_string());
         return Err(format!("HTTP {status}: {text}"));
     }
     Ok(())
