--- src/ui.rs
+++ replace ChatMessage::append_text with ()
@@ -254,18 +254,17 @@
             role,
             text,
             html,
             timestamp,
         }
     }
 
     fn append_text(&mut self, chunk: &str) {
-        self.text.push_str(chunk);
-        self.html = markdown_to_html(&self.text);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, PartialEq, Eq)]
 enum MessageRole {
     User,
     Bot,
 }
