--- src/ui.rs
+++ replace format_local_time -> String with "xyzzy".into()
@@ -286,23 +286,17 @@
 fn now_unix_ts() -> i64 {
     std::time::SystemTime::now()
         .duration_since(std::time::UNIX_EPOCH)
         .unwrap_or_default()
         .as_secs() as i64
 }
 
 fn format_local_time(ts: i64) -> String {
-    let dt = OffsetDateTime::from_unix_timestamp(ts)
-        .unwrap_or_else(|_| OffsetDateTime::UNIX_EPOCH + time::Duration::seconds(ts.max(0)));
-    let local_offset = UtcOffset::current_local_offset().unwrap_or(UtcOffset::UTC);
-    let local = dt.to_offset(local_offset);
-    local
-        .format(HISTORY_TIMESTAMP_FORMAT)
-        .unwrap_or_else(|_| ts.to_string())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_history_timestamp(raw: &str) -> Option<i64> {
     let trimmed = raw.trim();
     if let Ok(value) = trimmed.parse::<i64>() {
         return Some(if value >= 1_000_000_000_000 {
             value / 1000
         } else {
