--- src/ui.rs
+++ replace + with - in format_local_time
@@ -287,17 +287,17 @@
     std::time::SystemTime::now()
         .duration_since(std::time::UNIX_EPOCH)
         .unwrap_or_default()
         .as_secs() as i64
 }
 
 fn format_local_time(ts: i64) -> String {
     let dt = OffsetDateTime::from_unix_timestamp(ts)
-        .unwrap_or_else(|_| OffsetDateTime::UNIX_EPOCH + time::Duration::seconds(ts.max(0)));
+        .unwrap_or_else(|_| OffsetDateTime::UNIX_EPOCH - /* ~ changed by cargo-mutants ~ */ time::Duration::seconds(ts.max(0)));
     let local_offset = UtcOffset::current_local_offset().unwrap_or(UtcOffset::UTC);
     let local = dt.to_offset(local_offset);
     local
         .format(HISTORY_TIMESTAMP_FORMAT)
         .unwrap_or_else(|_| ts.to_string())
 }
 
 fn parse_history_timestamp(raw: &str) -> Option<i64> {
