--- src/ui.rs
+++ replace parse_history_timestamp -> Option<i64> with Some(0)
@@ -296,32 +296,17 @@
     let local_offset = UtcOffset::current_local_offset().unwrap_or(UtcOffset::UTC);
     let local = dt.to_offset(local_offset);
     local
         .format(HISTORY_TIMESTAMP_FORMAT)
         .unwrap_or_else(|_| ts.to_string())
 }
 
 fn parse_history_timestamp(raw: &str) -> Option<i64> {
-    let trimmed = raw.trim();
-    if let Ok(value) = trimmed.parse::<i64>() {
-        return Some(if value >= 1_000_000_000_000 {
-            value / 1000
-        } else {
-            value
-        });
-    }
-
-    if let Ok(parsed) = OffsetDateTime::parse(trimmed, &Rfc3339) {
-        return Some(parsed.unix_timestamp());
-    }
-
-    OffsetDateTime::parse(trimmed, HISTORY_TIMESTAMP_FORMAT)
-        .ok()
-        .map(|value| value.unix_timestamp())
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_history_entry(line: &str) -> Option<(MessageRole, String, Option<i64>)> {
     let trimmed = line.trim();
     let payload = trimmed.strip_prefix('[')?;
     let (ts_str, rest) = payload.split_once("] ")?;
     let (role, content) = rest.split_once(": ")?;
     if content.trim().is_empty() {
