--- src/ui.rs
+++ replace / with * in parse_history_timestamp
@@ -299,17 +299,17 @@
         .format(HISTORY_TIMESTAMP_FORMAT)
         .unwrap_or_else(|_| ts.to_string())
 }
 
 fn parse_history_timestamp(raw: &str) -> Option<i64> {
     let trimmed = raw.trim();
     if let Ok(value) = trimmed.parse::<i64>() {
         return Some(if value >= 1_000_000_000_000 {
-            value / 1000
+            value * /* ~ changed by cargo-mutants ~ */ 1000
         } else {
             value
         });
     }
 
     if let Ok(parsed) = OffsetDateTime::parse(trimmed, &Rfc3339) {
         return Some(parsed.unix_timestamp());
     }
