--- src/ui.rs
+++ replace parse_history_entry -> Option<(MessageRole, String, Option<i64>)> with Some((Default::default(), String::new(), Some(1)))
@@ -315,28 +315,17 @@
     }
 
     OffsetDateTime::parse(trimmed, HISTORY_TIMESTAMP_FORMAT)
         .ok()
         .map(|value| value.unix_timestamp())
 }
 
 fn parse_history_entry(line: &str) -> Option<(MessageRole, String, Option<i64>)> {
-    let trimmed = line.trim();
-    let payload = trimmed.strip_prefix('[')?;
-    let (ts_str, rest) = payload.split_once("] ")?;
-    let (role, content) = rest.split_once(": ")?;
-    if content.trim().is_empty() {
-        return None;
-    }
-    let role = match role.trim() {
-        "user" => MessageRole::User,
-        _ => MessageRole::Bot,
-    };
-    Some((role, content.to_string(), parse_history_timestamp(ts_str)))
+    Some((Default::default(), String::new(), Some(1))) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone, Copy, PartialEq, Eq)]
 enum UiTab {
     Chat,
     Activity,
     Config,
     Context,
