--- src/ui.rs
+++ replace send_desktop_notification with ()
@@ -24,23 +24,17 @@
 use time::format_description::well_known::Rfc3339;
 use time::{macros::format_description, OffsetDateTime, UtcOffset};
 use tokio::time::{sleep, timeout, Duration};
 
 const APP_LOGO: Asset = asset!("/assets/icons/hicolor/32x32/apps/butterfly-bot.png");
 
 #[cfg(target_os = "linux")]
 fn send_desktop_notification(title: &str) {
-    if let Err(err) = Notification::new()
-        .summary("Butterfly Bot")
-        .body(title)
-        .show()
-    {
-        eprintln!("Notification error: {err}");
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(target_os = "linux"))]
 fn send_desktop_notification(_title: &str) {}
 
 #[derive(Clone, Serialize)]
 struct ProcessTextRequest {
     user_id: String,
