--- src/ui.rs
+++ delete match arm "user" in parse_history_entry
@@ -323,17 +323,17 @@
     let trimmed = line.trim();
     let payload = trimmed.strip_prefix('[')?;
     let (ts_str, rest) = payload.split_once("] ")?;
     let (role, content) = rest.split_once(": ")?;
     if content.trim().is_empty() {
         return None;
     }
     let role = match role.trim() {
-        "user" => MessageRole::User,
+         /* ~ changed by cargo-mutants ~ */
         _ => MessageRole::Bot,
     };
     Some((role, content.to_string(), parse_history_timestamp(ts_str)))
 }
 
 #[derive(Clone, Copy, PartialEq, Eq)]
 enum UiTab {
     Chat,
