--- src/ui.rs
+++ replace is_url_source -> bool with false
@@ -359,18 +359,17 @@
     url: String,
     header_key: String,
     header_value: String,
     headers: HashMap<String, String>,
     primary_header_key: String,
 }
 
 fn is_url_source(value: &str) -> bool {
-    let trimmed = value.trim();
-    trimmed.starts_with("http://") || trimmed.starts_with("https://")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 async fn load_markdown_source(source: &str) -> Result<String, String> {
     let trimmed = source.trim();
     if trimmed.is_empty() {
         return Ok(String::new());
     }
     if is_url_source(trimmed) {
