--- src/ui.rs
+++ replace || with && in is_url_source
@@ -360,17 +360,17 @@
     header_key: String,
     header_value: String,
     headers: HashMap<String, String>,
     primary_header_key: String,
 }
 
 fn is_url_source(value: &str) -> bool {
     let trimmed = value.trim();
-    trimmed.starts_with("http://") || trimmed.starts_with("https://")
+    trimmed.starts_with("http://") && /* ~ changed by cargo-mutants ~ */ trimmed.starts_with("https://")
 }
 
 async fn load_markdown_source(source: &str) -> Result<String, String> {
     let trimmed = source.trim();
     if trimmed.is_empty() {
         return Ok(String::new());
     }
     if is_url_source(trimmed) {
