--- src/ui.rs
+++ delete ! in load_markdown_source
@@ -370,17 +370,17 @@
 
 async fn load_markdown_source(source: &str) -> Result<String, String> {
     let trimmed = source.trim();
     if trimmed.is_empty() {
         return Ok(String::new());
     }
     if is_url_source(trimmed) {
         let response = reqwest::get(trimmed).await.map_err(|err| err.to_string())?;
-        if !response.status().is_success() {
+        if  /* ~ changed by cargo-mutants ~ */response.status().is_success() {
             return Err(format!("Failed to fetch {trimmed}"));
         }
         return response.text().await.map_err(|err| err.to_string());
     }
     Err("Only URL markdown sources are supported for external loading.".to_string())
 }
 
 async fn save_markdown_source_to_store(
