--- src/ui.rs
+++ delete match arm "prompt" in save_markdown_source_to_store
@@ -386,17 +386,17 @@
 async fn save_markdown_source_to_store(
     db_path: String,
     target: &'static str,
     source: crate::config::MarkdownSource,
 ) -> Result<(), String> {
     let mut config = crate::config::Config::from_store(&db_path).map_err(|err| err.to_string())?;
     match target {
         "heartbeat" => config.heartbeat_source = source,
-        "prompt" => config.prompt_source = source,
+         /* ~ changed by cargo-mutants ~ */
         _ => return Err("Unknown markdown source target".to_string()),
     }
 
     let pretty = serde_json::to_string_pretty(&config).map_err(|err| err.to_string())?;
 
     let db_path_for_save = db_path.clone();
     let config_for_save = config.clone();
     let save_result = tokio::task::spawn_blocking(move || {
