--- src/ui.rs
+++ replace != with == in is_empty_list_result
@@ -424,17 +424,17 @@
 }
 
 fn is_empty_list_result(payload: &Value) -> bool {
     let action = payload
         .get("args")
         .and_then(|args| args.get("action"))
         .and_then(|value| value.as_str())
         .unwrap_or_default();
-    if action != "list" {
+    if action == /* ~ changed by cargo-mutants ~ */ "list" {
         return false;
     }
 
     let result = payload.get("result").unwrap_or(&Value::Null);
     ["reminders", "items", "tasks", "plans", "todos", "results"]
         .iter()
         .any(|key| {
             result
