--- src/ui.rs
+++ replace scroll_chat_after_render with ()
@@ -445,19 +445,17 @@
         })
 }
 
 async fn scroll_chat_to_bottom() {
     let _ = eval("const el = document.getElementById('chat-scroll'); if (el) { el.scrollTop = el.scrollHeight; }").await;
 }
 
 async fn scroll_chat_after_render() {
-    scroll_chat_to_bottom().await;
-    sleep(Duration::from_millis(16)).await;
-    scroll_chat_to_bottom().await;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 async fn scroll_activity_to_bottom() {
     let _ = eval("const el = document.getElementById('activity-scroll'); if (el) { el.scrollTop = el.scrollHeight; }").await;
 }
 
 async fn scroll_activity_after_render() {
     scroll_activity_to_bottom().await;
