--- src/ui.rs
+++ replace scroll_activity_to_bottom with ()
@@ -451,17 +451,17 @@
 
 async fn scroll_chat_after_render() {
     scroll_chat_to_bottom().await;
     sleep(Duration::from_millis(16)).await;
     scroll_chat_to_bottom().await;
 }
 
 async fn scroll_activity_to_bottom() {
-    let _ = eval("const el = document.getElementById('activity-scroll'); if (el) { el.scrollTop = el.scrollHeight; }").await;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 async fn scroll_activity_after_render() {
     scroll_activity_to_bottom().await;
     sleep(Duration::from_millis(16)).await;
     scroll_activity_to_bottom().await;
 }
 
