--- src/ui.rs
+++ replace highlight_json_html -> String with "xyzzy".into()
@@ -462,42 +462,17 @@
 async fn scroll_activity_after_render() {
     scroll_activity_to_bottom().await;
     sleep(Duration::from_millis(16)).await;
     scroll_activity_to_bottom().await;
 }
 
 #[allow(dead_code)]
 fn highlight_json_html(input: &str) -> String {
-    static SYNTAX_SET: once_cell::sync::Lazy<SyntaxSet> =
-        once_cell::sync::Lazy::new(SyntaxSet::load_defaults_newlines);
-    static THEMES: once_cell::sync::Lazy<ThemeSet> =
-        once_cell::sync::Lazy::new(ThemeSet::load_defaults);
-
-    let syntax = SYNTAX_SET
-        .find_syntax_by_extension("json")
-        .unwrap_or_else(|| SYNTAX_SET.find_syntax_plain_text());
-    let theme = THEMES
-        .themes
-        .get("base16-ocean.dark")
-        .or_else(|| THEMES.themes.values().next())
-        .expect("theme available");
-
-    let mut highlighter = HighlightLines::new(syntax, theme);
-    let mut out = String::new();
-    for line in LinesWithEndings::from(input) {
-        let ranges = highlighter
-            .highlight_line(line, &SYNTAX_SET)
-            .unwrap_or_default();
-        let html =
-            styled_line_to_highlighted_html(&ranges[..], syntect::html::IncludeBackground::No)
-                .unwrap_or_default();
-        out.push_str(&html);
-    }
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn launch_ui() {
     launch_ui_with_config(UiLaunchConfig::default());
 }
 
 #[derive(Clone)]
 pub struct UiLaunchConfig {
