--- src/ui.rs
+++ replace ui_launch_config_lock -> &'static Mutex<UiLaunchConfig> with Box::leak(Box::new(Mutex::new(Default::default())))
@@ -512,18 +512,17 @@
             db_path: crate::runtime_paths::default_db_path(),
             daemon_url: "http://127.0.0.1:7878".to_string(),
             user_id: "user".to_string(),
         }
     }
 }
 
 fn ui_launch_config_lock() -> &'static Mutex<UiLaunchConfig> {
-    static CONFIG: OnceLock<Mutex<UiLaunchConfig>> = OnceLock::new();
-    CONFIG.get_or_init(|| Mutex::new(UiLaunchConfig::default()))
+    Box::leak(Box::new(Mutex::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn set_ui_launch_config(config: UiLaunchConfig) {
     let lock = ui_launch_config_lock();
     match lock.lock() {
         Ok(mut guard) => *guard = config,
         Err(poisoned) => {
             let mut guard = poisoned.into_inner();
