--- src/ui.rs
+++ replace stream_timeout_duration -> Duration with Default::default()
@@ -542,17 +542,17 @@
 
 pub fn launch_ui_with_config(config: UiLaunchConfig) {
     set_ui_launch_config(config);
     force_dbusrs();
     launch(app_view);
 }
 
 fn stream_timeout_duration() -> Duration {
-    Duration::from_secs(180)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "linux")]
 fn force_dbusrs() {}
 
 #[cfg(not(target_os = "linux"))]
 fn force_dbusrs() {}
 
