--- src/ui.rs
+++ replace daemon_control -> &'static Mutex<Option<DaemonControl>> with Box::leak(Box::new(Mutex::new(None)))
@@ -557,18 +557,17 @@
 fn force_dbusrs() {}
 
 struct DaemonControl {
     shutdown: tokio::sync::oneshot::Sender<()>,
     thread: thread::JoinHandle<()>,
 }
 
 fn daemon_control() -> &'static Mutex<Option<DaemonControl>> {
-    static CONTROL: OnceLock<Mutex<Option<DaemonControl>>> = OnceLock::new();
-    CONTROL.get_or_init(|| Mutex::new(None))
+    Box::leak(Box::new(Mutex::new(None))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn start_local_daemon() -> Result<(), String> {
     let control = daemon_control();
     let mut guard = control
         .lock()
         .map_err(|_| "Daemon lock unavailable".to_string())?;
     if guard.is_some() {
