--- src/ui.rs
+++ replace start_local_daemon -> Result<(), String> with Ok(())
@@ -562,50 +562,17 @@
 }
 
 fn daemon_control() -> &'static Mutex<Option<DaemonControl>> {
     static CONTROL: OnceLock<Mutex<Option<DaemonControl>>> = OnceLock::new();
     CONTROL.get_or_init(|| Mutex::new(None))
 }
 
 fn start_local_daemon() -> Result<(), String> {
-    let control = daemon_control();
-    let mut guard = control
-        .lock()
-        .map_err(|_| "Daemon lock unavailable".to_string())?;
-    if guard.is_some() {
-        return Ok(());
-    }
-
-    let config = ui_launch_config();
-    let daemon_url = config.daemon_url;
-    let (host, port) = parse_daemon_address(&daemon_url);
-    let db_path = config.db_path;
-    let token = env_auth_token();
-
-    let (shutdown_tx, shutdown_rx) = tokio::sync::oneshot::channel::<()>();
-
-    let thread = thread::spawn(move || {
-        if let Ok(runtime) = tokio::runtime::Runtime::new() {
-            runtime.block_on(async move {
-                let shutdown = async move {
-                    let _ = shutdown_rx.await;
-                };
-                let _ =
-                    crate::daemon::run_with_shutdown(&host, port, &db_path, &token, shutdown).await;
-            });
-        }
-    });
-
-    *guard = Some(DaemonControl {
-        shutdown: shutdown_tx,
-        thread,
-    });
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn env_auth_token() -> String {
     crate::vault::ensure_daemon_auth_token().unwrap_or_default()
 }
 
 fn stop_local_daemon() -> Result<(), String> {
     let control = daemon_control();
