--- src/ui.rs
+++ replace normalize_daemon_url -> String with String::new()
@@ -619,26 +619,17 @@
         });
         Ok(())
     } else {
         Err("Daemon is not running".to_string())
     }
 }
 
 fn normalize_daemon_url(daemon: &str) -> String {
-    let trimmed = daemon.trim();
-    let (scheme, rest) = if let Some(value) = trimmed.strip_prefix("https://") {
-        ("https://", value)
-    } else if let Some(value) = trimmed.strip_prefix("http://") {
-        ("http://", value)
-    } else {
-        ("http://", trimmed)
-    };
-    let host_port = rest.split('/').next().unwrap_or("127.0.0.1:7878");
-    format!("{scheme}{host_port}")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_daemon_address(daemon: &str) -> (String, u16) {
     let trimmed = daemon.trim();
     let without_scheme = trimmed
         .strip_prefix("http://")
         .or_else(|| trimmed.strip_prefix("https://"))
         .unwrap_or(trimmed);
