--- src/ui.rs
+++ replace + with * in app_view
@@ -761,17 +761,17 @@
                     return;
                 }
 
                 busy.set(true);
                 error.set(String::new());
 
                 let user_message_id = {
                     let id = next_id();
-                    next_id.set(id + 1);
+                    next_id.set(id * /* ~ changed by cargo-mutants ~ */ 1);
                     id
                 };
                 let bot_message_id = {
                     let id = next_id();
                     next_id.set(id + 1);
                     id
                 };
                 let timestamp = now_unix_ts();
