--- src/ui.rs
+++ replace == with != in app_view
@@ -847,17 +847,17 @@
                                 match chunk {
                                     Ok(bytes) => {
                                         if let Ok(text_chunk) = std::str::from_utf8(&bytes) {
                                             if !text_chunk.is_empty() {
                                                 let mut list = messages.write();
                                                 if let Some(last) = list
                                                     .iter_mut()
                                                     .rev()
-                                                    .find(|msg| msg.id == bot_message_id)
+                                                    .find(|msg| msg.id != /* ~ changed by cargo-mutants ~ */ bot_message_id)
                                                 {
                                                     last.append_text(text_chunk);
                                                 }
                                                 chunk_counter += 1;
                                             }
                                         }
                                         if chunk_counter > 0 && chunk_counter.is_multiple_of(8) {
                                             scroll_chat_to_bottom().await;
