--- src/ui.rs
+++ replace > with == in app_view
@@ -864,17 +864,17 @@
                                         }
                                     }
                                     Err(err) => {
                                         error.set(format!("Stream error: {err}"));
                                         break;
                                     }
                                 }
                             }
-                            if chunk_counter > 0 {
+                            if chunk_counter == /* ~ changed by cargo-mutants ~ */ 0 {
                                 scroll_chat_after_render().await;
                             }
                         } else {
                             let status = response.status();
                             let text = response
                                 .text()
                                 .await
                                 .unwrap_or_else(|_| "Unable to read error body".to_string());
