--- src/ui.rs
+++ replace run_doctor_request -> Result<DoctorResponse, String> with Ok(Default::default())
@@ -89,35 +89,17 @@
 #[allow(dead_code)]
 #[derive(Clone, Deserialize)]
 struct FactoryResetConfigResponse {
     message: String,
     config: Value,
 }
 
 async fn run_doctor_request(daemon_url: String, token: String) -> Result<DoctorResponse, String> {
-    let client = reqwest::Client::new();
-    let url = format!("{}/doctor", daemon_url.trim_end_matches('/'));
-    let mut request = client.post(url);
-    if !token.trim().is_empty() {
-        request = request.header("authorization", format!("Bearer {token}"));
-    }
-    let response = request.send().await.map_err(|err| err.to_string())?;
-    if !response.status().is_success() {
-        let status = response.status();
-        let text = response
-            .text()
-            .await
-            .unwrap_or_else(|_| "Unable to read response body".to_string());
-        return Err(format!("HTTP {status}: {text}"));
-    }
-    response
-        .json::<DoctorResponse>()
-        .await
-        .map_err(|err| err.to_string())
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[allow(dead_code)]
 async fn run_security_audit_request(
     daemon_url: String,
     token: String,
 ) -> Result<SecurityAuditResponse, String> {
     let client = reqwest::Client::new();
