--- src/daemon.rs
+++ replace match guard response.status().is_success() with false in check_provider_health
@@ -1012,17 +1012,17 @@
         ));
     }
 
     let models_url = format!("{}/models", base_url.trim_end_matches('/'));
     let client = reqwest::Client::new();
     let result = tokio::time::timeout(Duration::from_secs(3), client.get(&models_url).send()).await;
 
     match result {
-        Ok(Ok(response)) if response.status().is_success() => Ok(doctor_check(
+        Ok(Ok(response)) if false /* ~ changed by cargo-mutants ~ */ => Ok(doctor_check(
             "provider_health",
             "pass",
             format!("Provider responded successfully at {models_url}"),
             None,
         )),
         Ok(Ok(response)) => Ok(doctor_check(
             "provider_health",
             "warn",
