--- src/daemon.rs
+++ delete ! in preload_boot
@@ -1242,17 +1242,17 @@
 
         let prompt_status = if let Ok(config) = Config::from_store(&db_path) {
             let source = config.prompt_source;
             match tokio::time::timeout(quick_timeout, load_markdown_content(&source)).await {
                 Ok(Ok(markdown)) => {
                     agent.set_prompt_markdown(markdown.clone()).await;
                     if markdown
                         .as_ref()
-                        .map(|m| !m.trim().is_empty())
+                        .map(|m|  /* ~ changed by cargo-mutants ~ */m.trim().is_empty())
                         .unwrap_or(false)
                     {
                         "ok".to_string()
                     } else {
                         "empty".to_string()
                     }
                 }
                 Ok(Err(err)) => format!("error: {err}"),
