--- src/daemon.rs
+++ replace == with != in preload_boot
@@ -1296,17 +1296,17 @@
             event_type: "boot".to_string(),
             user_id: user_id.clone(),
             tool: "prompt".to_string(),
             status: prompt_status.clone(),
             payload: json!({"status": prompt_status}),
             timestamp: now_ts(),
         });
 
-        if (heartbeat_status == "ok"
+        if (heartbeat_status != /* ~ changed by cargo-mutants ~ */ "ok"
             || heartbeat_status == "empty"
             || heartbeat_status == "deferred")
             && (prompt_status == "ok" || prompt_status == "empty" || prompt_status == "deferred")
         {
             let agent = agent.clone();
             let ui_event_tx = ui_event_tx.clone();
             let user_id = user_id.clone();
             tokio::spawn(async move {
