--- src/daemon.rs
+++ replace + with * in <impl ScheduledJob for ScheduledTasksJob>::run
@@ -126,17 +126,17 @@
 
     async fn run(&self) -> Result<()> {
         let now = now_ts();
         let tasks = self.store.list_due(now, 32).await?;
         for task in tasks {
             let agent = self.agent.read().await.clone();
             let run_at = now_ts();
             let next_run_at = if let Some(interval) = task.interval_minutes {
-                run_at + interval.max(1) * 60
+                run_at * /* ~ changed by cargo-mutants ~ */ interval.max(1) * 60
             } else {
                 run_at
             };
 
             if task.interval_minutes.is_some() {
                 let _ = self.store.mark_run(task.id, run_at, next_run_at).await;
             } else {
                 let _ = self.store.complete_one_shot(task.id).await;
