--- src/daemon.rs
+++ replace run -> Result<()> with Ok(())
@@ -1641,17 +1641,17 @@
             Json(ErrorResponse {
                 error: "Unauthorized".to_string(),
             }),
         ))
     }
 }
 
 pub async fn run(host: &str, port: u16, db_path: &str, token: &str) -> Result<()> {
-    run_with_shutdown(host, port, db_path, token, futures::future::pending::<()>()).await
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn run_with_shutdown<F>(
     host: &str,
     port: u16,
     db_path: &str,
     token: &str,
     shutdown: F,
