--- src/daemon.rs
+++ replace ui_event_log_path -> Option<String> with None
@@ -1953,24 +1953,17 @@
     let line = serde_json::to_string(&entry)
         .map_err(|e| ButterflyBotError::Serialization(e.to_string()))?;
     use std::io::Write;
     writeln!(file, "{line}").map_err(|e| ButterflyBotError::Runtime(e.to_string()))?;
     Ok(())
 }
 
 fn ui_event_log_path(config: Option<&Config>) -> Option<String> {
-    config
-        .and_then(|cfg| cfg.tools.as_ref())
-        .and_then(|tools| tools.get("settings"))
-        .and_then(|settings| settings.get("ui_event_log_path"))
-        .and_then(|value| value.as_str())
-        .map(|value| value.trim().to_string())
-        .filter(|value| !value.is_empty())
-        .or_else(|| Some("./data/ui_events.log".to_string()))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_ui_event_log(path: &str, event: &UiEvent) -> Result<()> {
     config_store::ensure_parent_dir(path)?;
     let payload = serde_json::to_string(event)
         .map_err(|e| ButterflyBotError::Serialization(e.to_string()))?;
     let mut file = std::fs::OpenOptions::new()
         .create(true)
