--- src/daemon.rs
+++ delete ! in ui_event_log_path
@@ -1959,17 +1959,17 @@
 
 fn ui_event_log_path(config: Option<&Config>) -> Option<String> {
     config
         .and_then(|cfg| cfg.tools.as_ref())
         .and_then(|tools| tools.get("settings"))
         .and_then(|settings| settings.get("ui_event_log_path"))
         .and_then(|value| value.as_str())
         .map(|value| value.trim().to_string())
-        .filter(|value| !value.is_empty())
+        .filter(|value|  /* ~ changed by cargo-mutants ~ */value.is_empty())
         .or_else(|| Some("./data/ui_events.log".to_string()))
 }
 
 fn write_ui_event_log(path: &str, event: &UiEvent) -> Result<()> {
     config_store::ensure_parent_dir(path)?;
     let payload = serde_json::to_string(event)
         .map_err(|e| ButterflyBotError::Serialization(e.to_string()))?;
     let mut file = std::fs::OpenOptions::new()
