--- src/daemon.rs
+++ replace <impl ScheduledJob for WakeupJob>::name -> &str with ""
@@ -188,17 +188,17 @@
         }
         Ok(())
     }
 }
 
 #[async_trait::async_trait]
 impl ScheduledJob for WakeupJob {
     fn name(&self) -> &str {
-        "wakeup"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn interval(&self) -> Duration {
         self.interval
     }
 
     async fn run(&self) -> Result<()> {
         let now = now_ts();
