--- src/daemon.rs
+++ replace + with * in <impl ScheduledJob for WakeupJob>::run
@@ -292,17 +292,17 @@
                 run_autonomy_tick(agent, ui_event_tx, "system".to_string(), "wakeup").await;
             });
         }
 
         let tasks = self.store.list_due(now, 32).await?;
         for task in tasks {
             let agent = self.agent.read().await.clone();
             let run_at = now_ts();
-            let next_run_at = run_at + task.interval_minutes.max(1) * 60;
+            let next_run_at = run_at * /* ~ changed by cargo-mutants ~ */ task.interval_minutes.max(1) * 60;
             let _ = self.store.mark_run(task.id, run_at, next_run_at).await;
 
             let options = ProcessOptions {
                 prompt: None,
                 images: Vec::new(),
                 output_format: OutputFormat::Text,
                 image_detail: "auto".to_string(),
                 json_schema: None,
