--- src/daemon.rs
+++ replace set_autonomy_cooldown_seconds with ()
@@ -46,17 +46,17 @@
     pub ui_event_tx: broadcast::Sender<UiEvent>,
     pub db_path: String,
 }
 
 static AUTONOMY_LAST_RUN_TS: AtomicI64 = AtomicI64::new(0);
 static AUTONOMY_COOLDOWN_SECS: AtomicI64 = AtomicI64::new(60);
 
 fn set_autonomy_cooldown_seconds(seconds: u64) {
-    AUTONOMY_COOLDOWN_SECS.store(seconds.max(1) as i64, Ordering::Relaxed);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn try_begin_autonomy_tick(now_ts: i64) -> Option<i64> {
     loop {
         let cooldown = AUTONOMY_COOLDOWN_SECS.load(Ordering::Relaxed).max(1);
         let last = AUTONOMY_LAST_RUN_TS.load(Ordering::Relaxed);
         if last > 0 {
             let elapsed = now_ts.saturating_sub(last);
