--- src/daemon.rs
+++ replace health -> Json<HealthResponse> with Json::from_iter([Default::default()])
@@ -578,19 +578,17 @@
                 error: err.to_string(),
             }),
         )
             .into_response(),
     }
 }
 
 async fn health() -> Json<HealthResponse> {
-    Json(HealthResponse {
-        status: "ok".to_string(),
-    })
+    Json::from_iter([Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn doctor(State(state): State<AppState>, headers: HeaderMap) -> impl IntoResponse {
     if let Err(err) = authorize(&headers, &state.token) {
         return err.into_response();
     }
 
     let checks = run_doctor_checks(&state).await;
