--- src/daemon.rs
+++ replace <impl ScheduledJob for BrainTickJob>::run -> Result<()> with Ok(())
@@ -85,19 +85,17 @@
         "brain_tick"
     }
 
     fn interval(&self) -> Duration {
         self.interval
     }
 
     async fn run(&self) -> Result<()> {
-        let agent = self.agent.read().await.clone();
-        agent.brain_tick().await;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 struct WakeupJob {
     agent: Arc<RwLock<Arc<ButterflyBot>>>,
     store: Arc<WakeupStore>,
     interval: Duration,
     ui_event_tx: broadcast::Sender<UiEvent>,
