--- src/vault.rs
+++ replace CocoonFileSecretProvider::passphrase -> Result<String> with Ok(String::new())
@@ -15,17 +15,17 @@
     ) -> Result<()>;
     fn get_secret(&self, name: &str) -> Result<Option<String>>;
 }
 
 struct CocoonFileSecretProvider;
 
 impl CocoonFileSecretProvider {
     fn passphrase(&self) -> Result<String> {
-        crate::security::tpm_provider::resolve_dek_passphrase()
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn secret_path(&self, name: &str) -> PathBuf {
         let sanitized = name
             .chars()
             .map(|ch| {
                 if ch.is_ascii_alphanumeric() || matches!(ch, '_' | '-' | '.') {
                     ch
