--- src/vault.rs
+++ replace build_default_provider -> Arc<dyn SecretProvider> with Arc::new(Default::default())
@@ -57,17 +57,17 @@
         let passphrase = self.passphrase()?;
         crate::security::hardening::with_sensitive_string(passphrase, |sensitive_passphrase| {
             cocoon_store::load_secret(&self.secret_path(name), sensitive_passphrase)
         })
     }
 }
 
 fn build_default_provider() -> Arc<dyn SecretProvider> {
-    Arc::new(CocoonFileSecretProvider)
+    Arc::new(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 static SECRET_PROVIDER: OnceLock<RwLock<Arc<dyn SecretProvider>>> = OnceLock::new();
 
 fn provider_lock() -> &'static RwLock<Arc<dyn SecretProvider>> {
     SECRET_PROVIDER.get_or_init(|| RwLock::new(build_default_provider()))
 }
 
